const options = [
    {
        "code": "45",
        "value": "广西壮族自治区",
        "children": [
            {
                "code": "4501",
                "value": "南宁市",
                "children": [
                    {
                        "code": "450102",
                        "value": "兴宁区",
                        "children": [
                            {
                                "code": "450102001",
                                "value": "民生街道"
                            },
                            {
                                "code": "450102002",
                                "value": "朝阳街道"
                            },
                            {
                                "code": "450102003",
                                "value": "兴东街道"
                            },
                            {
                                "code": "450102101",
                                "value": "三塘镇"
                            },
                            {
                                "code": "450102102",
                                "value": "五塘镇"
                            },
                            {
                                "code": "450102104",
                                "value": "昆仑镇"
                            },
                            {
                                "code": "450102450",
                                "value": "九曲湾农场"
                            }
                        ]
                    },
                    {
                        "code": "450103",
                        "value": "青秀区",
                        "children": [
                            {
                                "code": "450103001",
                                "value": "新竹街道"
                            },
                            {
                                "code": "450103002",
                                "value": "中山街道"
                            },
                            {
                                "code": "450103003",
                                "value": "建政街道"
                            },
                            {
                                "code": "450103004",
                                "value": "南湖街道"
                            },
                            {
                                "code": "450103005",
                                "value": "津头街道"
                            },
                            {
                                "code": "450103006",
                                "value": "仙葫经济开发区管理委员会"
                            },
                            {
                                "code": "450103100",
                                "value": "刘圩镇"
                            },
                            {
                                "code": "450103101",
                                "value": "南阳镇"
                            },
                            {
                                "code": "450103102",
                                "value": "伶俐镇"
                            },
                            {
                                "code": "450103103",
                                "value": "长塘镇"
                            },
                            {
                                "code": "450103451",
                                "value": "青秀山管理委员会"
                            }
                        ]
                    },
                    {
                        "code": "450105",
                        "value": "江南区",
                        "children": [
                            {
                                "code": "450105001",
                                "value": "福建园街道"
                            },
                            {
                                "code": "450105002",
                                "value": "江南街道"
                            },
                            {
                                "code": "450105003",
                                "value": "沙井街道"
                            },
                            {
                                "code": "450105004",
                                "value": "那洪街道"
                            },
                            {
                                "code": "450105005",
                                "value": "金凯街道"
                            },
                            {
                                "code": "450105102",
                                "value": "吴圩镇"
                            },
                            {
                                "code": "450105103",
                                "value": "苏圩镇"
                            },
                            {
                                "code": "450105104",
                                "value": "延安镇"
                            },
                            {
                                "code": "450105105",
                                "value": "江西镇"
                            },
                            {
                                "code": "450105450",
                                "value": "经济技术开发区"
                            },
                            {
                                "code": "450105451",
                                "value": "明阳工业园区管委会"
                            }
                        ]
                    },
                    {
                        "code": "450107",
                        "value": "西乡塘区",
                        "children": [
                            {
                                "code": "450107001",
                                "value": "衡阳街道"
                            },
                            {
                                "code": "450107002",
                                "value": "北湖街道"
                            },
                            {
                                "code": "450107003",
                                "value": "西乡塘街道"
                            },
                            {
                                "code": "450107004",
                                "value": "安吉街道"
                            },
                            {
                                "code": "450107005",
                                "value": "华强街道"
                            },
                            {
                                "code": "450107006",
                                "value": "新阳街道"
                            },
                            {
                                "code": "450107007",
                                "value": "上尧街道"
                            },
                            {
                                "code": "450107008",
                                "value": "安宁街道"
                            },
                            {
                                "code": "450107009",
                                "value": "石埠街道"
                            },
                            {
                                "code": "450107010",
                                "value": "心圩街道"
                            },
                            {
                                "code": "450107100",
                                "value": "金陵镇"
                            },
                            {
                                "code": "450107101",
                                "value": "双定镇"
                            },
                            {
                                "code": "450107105",
                                "value": "坛洛镇"
                            },
                            {
                                "code": "450107450",
                                "value": "那龙矿务局"
                            },
                            {
                                "code": "450107453",
                                "value": "金光农场"
                            },
                            {
                                "code": "450107454",
                                "value": "高新技术开发区管委会"
                            }
                        ]
                    },
                    {
                        "code": "450108",
                        "value": "良庆区",
                        "children": [
                            {
                                "code": "450108001",
                                "value": "大沙田街道"
                            },
                            {
                                "code": "450108002",
                                "value": "玉洞街道"
                            },
                            {
                                "code": "450108100",
                                "value": "良庆镇"
                            },
                            {
                                "code": "450108101",
                                "value": "那马镇"
                            },
                            {
                                "code": "450108102",
                                "value": "那陈镇"
                            },
                            {
                                "code": "450108103",
                                "value": "大塘镇"
                            },
                            {
                                "code": "450108104",
                                "value": "南晓镇"
                            },
                            {
                                "code": "450108452",
                                "value": "良庆经济开发区管委会"
                            }
                        ]
                    },
                    {
                        "code": "450109",
                        "value": "邕宁区",
                        "children": [
                            {
                                "code": "450109100",
                                "value": "蒲庙镇"
                            },
                            {
                                "code": "450109101",
                                "value": "那楼镇"
                            },
                            {
                                "code": "450109102",
                                "value": "新江镇"
                            },
                            {
                                "code": "450109103",
                                "value": "百济镇"
                            },
                            {
                                "code": "450109202",
                                "value": "中和乡"
                            }
                        ]
                    },
                    {
                        "code": "450110",
                        "value": "武鸣区",
                        "children": [
                            {
                                "code": "450110100",
                                "value": "城厢镇"
                            },
                            {
                                "code": "450110102",
                                "value": "太平镇"
                            },
                            {
                                "code": "450110103",
                                "value": "双桥镇"
                            },
                            {
                                "code": "450110104",
                                "value": "宁武镇"
                            },
                            {
                                "code": "450110105",
                                "value": "锣圩镇"
                            },
                            {
                                "code": "450110106",
                                "value": "仙湖镇"
                            },
                            {
                                "code": "450110107",
                                "value": "府城镇"
                            },
                            {
                                "code": "450110108",
                                "value": "陆斡镇"
                            },
                            {
                                "code": "450110109",
                                "value": "两江镇"
                            },
                            {
                                "code": "450110110",
                                "value": "罗波镇"
                            },
                            {
                                "code": "450110111",
                                "value": "灵马镇"
                            },
                            {
                                "code": "450110112",
                                "value": "甘圩镇"
                            },
                            {
                                "code": "450110113",
                                "value": "马头镇"
                            },
                            {
                                "code": "450110451",
                                "value": "南宁华侨投资区"
                            },
                            {
                                "code": "450110452",
                                "value": "东风农场"
                            }
                        ]
                    },
                    {
                        "code": "450123",
                        "value": "隆安县",
                        "children": [
                            {
                                "code": "450123100",
                                "value": "城厢镇"
                            },
                            {
                                "code": "450123101",
                                "value": "南圩镇"
                            },
                            {
                                "code": "450123102",
                                "value": "雁江镇"
                            },
                            {
                                "code": "450123103",
                                "value": "那桐镇"
                            },
                            {
                                "code": "450123104",
                                "value": "乔建镇"
                            },
                            {
                                "code": "450123105",
                                "value": "丁当镇"
                            },
                            {
                                "code": "450123201",
                                "value": "古潭乡"
                            },
                            {
                                "code": "450123203",
                                "value": "都结乡"
                            },
                            {
                                "code": "450123204",
                                "value": "布泉乡"
                            },
                            {
                                "code": "450123205",
                                "value": "屏山乡"
                            },
                            {
                                "code": "450123450",
                                "value": "隆安华侨管理区管理委员会"
                            }
                        ]
                    },
                    {
                        "code": "450124",
                        "value": "马山县",
                        "children": [
                            {
                                "code": "450124100",
                                "value": "白山镇"
                            },
                            {
                                "code": "450124101",
                                "value": "百龙滩镇"
                            },
                            {
                                "code": "450124102",
                                "value": "林圩镇"
                            },
                            {
                                "code": "450124103",
                                "value": "古零镇"
                            },
                            {
                                "code": "450124104",
                                "value": "金钗镇"
                            },
                            {
                                "code": "450124105",
                                "value": "周鹿镇"
                            },
                            {
                                "code": "450124106",
                                "value": "永州镇"
                            },
                            {
                                "code": "450124200",
                                "value": "乔利乡"
                            },
                            {
                                "code": "450124201",
                                "value": "加方乡"
                            },
                            {
                                "code": "450124202",
                                "value": "古寨瑶族乡"
                            },
                            {
                                "code": "450124203",
                                "value": "里当瑶族乡"
                            },
                            {
                                "code": "450124450",
                                "value": "光明山林场"
                            }
                        ]
                    },
                    {
                        "code": "450125",
                        "value": "上林县",
                        "children": [
                            {
                                "code": "450125100",
                                "value": "大丰镇"
                            },
                            {
                                "code": "450125101",
                                "value": "明亮镇"
                            },
                            {
                                "code": "450125102",
                                "value": "巷贤镇"
                            },
                            {
                                "code": "450125103",
                                "value": "白圩镇"
                            },
                            {
                                "code": "450125104",
                                "value": "三里镇"
                            },
                            {
                                "code": "450125105",
                                "value": "乔贤镇"
                            },
                            {
                                "code": "450125106",
                                "value": "西燕镇"
                            },
                            {
                                "code": "450125200",
                                "value": "澄泰乡"
                            },
                            {
                                "code": "450125202",
                                "value": "木山乡"
                            },
                            {
                                "code": "450125203",
                                "value": "塘红乡"
                            },
                            {
                                "code": "450125205",
                                "value": "镇圩瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "450126",
                        "value": "宾阳县",
                        "children": [
                            {
                                "code": "450126100",
                                "value": "宾州镇"
                            },
                            {
                                "code": "450126101",
                                "value": "黎塘镇"
                            },
                            {
                                "code": "450126102",
                                "value": "甘棠镇"
                            },
                            {
                                "code": "450126103",
                                "value": "思陇镇"
                            },
                            {
                                "code": "450126104",
                                "value": "新桥镇"
                            },
                            {
                                "code": "450126105",
                                "value": "新圩镇"
                            },
                            {
                                "code": "450126106",
                                "value": "邹圩镇"
                            },
                            {
                                "code": "450126107",
                                "value": "大桥镇"
                            },
                            {
                                "code": "450126108",
                                "value": "武陵镇"
                            },
                            {
                                "code": "450126109",
                                "value": "中华镇"
                            },
                            {
                                "code": "450126110",
                                "value": "古辣镇"
                            },
                            {
                                "code": "450126111",
                                "value": "露圩镇"
                            },
                            {
                                "code": "450126112",
                                "value": "王灵镇"
                            },
                            {
                                "code": "450126113",
                                "value": "和吉镇"
                            },
                            {
                                "code": "450126114",
                                "value": "洋桥镇"
                            },
                            {
                                "code": "450126115",
                                "value": "陈平镇"
                            },
                            {
                                "code": "450126451",
                                "value": "廖平农场"
                            }
                        ]
                    },
                    {
                        "code": "450127",
                        "value": "横县",
                        "children": [
                            {
                                "code": "450127100",
                                "value": "横州镇"
                            },
                            {
                                "code": "450127101",
                                "value": "百合镇"
                            },
                            {
                                "code": "450127102",
                                "value": "那阳镇"
                            },
                            {
                                "code": "450127103",
                                "value": "南乡镇"
                            },
                            {
                                "code": "450127104",
                                "value": "新福镇"
                            },
                            {
                                "code": "450127105",
                                "value": "莲塘镇"
                            },
                            {
                                "code": "450127106",
                                "value": "平马镇"
                            },
                            {
                                "code": "450127107",
                                "value": "峦城镇"
                            },
                            {
                                "code": "450127108",
                                "value": "六景镇"
                            },
                            {
                                "code": "450127110",
                                "value": "石塘镇"
                            },
                            {
                                "code": "450127112",
                                "value": "陶圩镇"
                            },
                            {
                                "code": "450127113",
                                "value": "校椅镇"
                            },
                            {
                                "code": "450127114",
                                "value": "云表镇"
                            },
                            {
                                "code": "450127115",
                                "value": "马岭镇"
                            },
                            {
                                "code": "450127200",
                                "value": "马山乡"
                            },
                            {
                                "code": "450127203",
                                "value": "平朗乡"
                            },
                            {
                                "code": "450127204",
                                "value": "镇龙乡"
                            },
                            {
                                "code": "450127450",
                                "value": "良圻农场"
                            }
                        ]
                    }
                ]
            },
            {
                "code": "4502",
                "value": "柳州市",
                "children": [
                    {
                        "code": "450202",
                        "value": "城中区",
                        "children": [
                            {
                                "code": "450202001",
                                "value": "城中街道"
                            },
                            {
                                "code": "450202002",
                                "value": "公园街道"
                            },
                            {
                                "code": "450202003",
                                "value": "中南街道"
                            },
                            {
                                "code": "450202004",
                                "value": "水上街道"
                            },
                            {
                                "code": "450202005",
                                "value": "潭中街道"
                            },
                            {
                                "code": "450202006",
                                "value": "河东街道"
                            },
                            {
                                "code": "450202007",
                                "value": "静兰街道"
                            }
                        ]
                    },
                    {
                        "code": "450203",
                        "value": "鱼峰区",
                        "children": [
                            {
                                "code": "450203001",
                                "value": "天马街道"
                            },
                            {
                                "code": "450203002",
                                "value": "驾鹤街道"
                            },
                            {
                                "code": "450203003",
                                "value": "箭盘山街道"
                            },
                            {
                                "code": "450203004",
                                "value": "五里亭街道"
                            },
                            {
                                "code": "450203005",
                                "value": "荣军街道"
                            },
                            {
                                "code": "450203006",
                                "value": "白莲街道"
                            },
                            {
                                "code": "450203007",
                                "value": "麒麟街道"
                            },
                            {
                                "code": "450203008",
                                "value": "阳和街道"
                            },
                            {
                                "code": "450203100",
                                "value": "雒容镇"
                            },
                            {
                                "code": "450203101",
                                "value": "洛埠镇"
                            }
                        ]
                    },
                    {
                        "code": "450204",
                        "value": "柳南区",
                        "children": [
                            {
                                "code": "450204001",
                                "value": "河西街道"
                            },
                            {
                                "code": "450204002",
                                "value": "南站街道"
                            },
                            {
                                "code": "450204003",
                                "value": "鹅山街道"
                            },
                            {
                                "code": "450204004",
                                "value": "柳南街道"
                            },
                            {
                                "code": "450204005",
                                "value": "柳石街道"
                            },
                            {
                                "code": "450204006",
                                "value": "银山街道"
                            },
                            {
                                "code": "450204007",
                                "value": "潭西街道"
                            },
                            {
                                "code": "450204008",
                                "value": "南环街道"
                            },
                            {
                                "code": "450204100",
                                "value": "太阳村镇"
                            }
                        ]
                    },
                    {
                        "code": "450205",
                        "value": "柳北区",
                        "children": [
                            {
                                "code": "450205001",
                                "value": "解放街道"
                            },
                            {
                                "code": "450205002",
                                "value": "雅儒街道"
                            },
                            {
                                "code": "450205003",
                                "value": "胜利街道"
                            },
                            {
                                "code": "450205004",
                                "value": "雀儿山街道"
                            },
                            {
                                "code": "450205005",
                                "value": "钢城街道"
                            },
                            {
                                "code": "450205006",
                                "value": "锦绣街道"
                            },
                            {
                                "code": "450205007",
                                "value": "白露街道"
                            },
                            {
                                "code": "450205100",
                                "value": "石碑坪镇"
                            },
                            {
                                "code": "450205101",
                                "value": "沙塘镇"
                            },
                            {
                                "code": "450205102",
                                "value": "长塘镇"
                            }
                        ]
                    },
                    {
                        "code": "450206",
                        "value": "柳江区",
                        "children": [
                            {
                                "code": "450206100",
                                "value": "拉堡镇"
                            },
                            {
                                "code": "450206101",
                                "value": "里雍镇"
                            },
                            {
                                "code": "450206102",
                                "value": "百朋镇"
                            },
                            {
                                "code": "450206103",
                                "value": "成团镇"
                            },
                            {
                                "code": "450206104",
                                "value": "洛满镇"
                            },
                            {
                                "code": "450206105",
                                "value": "流山镇"
                            },
                            {
                                "code": "450206106",
                                "value": "三都镇"
                            },
                            {
                                "code": "450206107",
                                "value": "里高镇"
                            },
                            {
                                "code": "450206108",
                                "value": "进德镇"
                            },
                            {
                                "code": "450206109",
                                "value": "穿山镇"
                            },
                            {
                                "code": "450206110",
                                "value": "土博镇"
                            },
                            {
                                "code": "450206111",
                                "value": "白沙镇"
                            },
                            {
                                "code": "450206400",
                                "value": "新兴工业园"
                            },
                            {
                                "code": "450206401",
                                "value": "新兴农场"
                            }
                        ]
                    },
                    {
                        "code": "450222",
                        "value": "柳城县",
                        "children": [
                            {
                                "code": "450222100",
                                "value": "大埔镇"
                            },
                            {
                                "code": "450222101",
                                "value": "龙头镇"
                            },
                            {
                                "code": "450222102",
                                "value": "太平镇"
                            },
                            {
                                "code": "450222103",
                                "value": "沙埔镇"
                            },
                            {
                                "code": "450222104",
                                "value": "东泉镇"
                            },
                            {
                                "code": "450222105",
                                "value": "凤山镇"
                            },
                            {
                                "code": "450222106",
                                "value": "六塘镇"
                            },
                            {
                                "code": "450222107",
                                "value": "冲脉镇"
                            },
                            {
                                "code": "450222108",
                                "value": "寨隆镇"
                            },
                            {
                                "code": "450222109",
                                "value": "马山镇"
                            },
                            {
                                "code": "450222200",
                                "value": "古砦仫佬族乡"
                            },
                            {
                                "code": "450222202",
                                "value": "社冲乡"
                            }
                        ]
                    },
                    {
                        "code": "450223",
                        "value": "鹿寨县",
                        "children": [
                            {
                                "code": "450223100",
                                "value": "鹿寨镇"
                            },
                            {
                                "code": "450223102",
                                "value": "中渡镇"
                            },
                            {
                                "code": "450223103",
                                "value": "寨沙镇"
                            },
                            {
                                "code": "450223104",
                                "value": "平山镇"
                            },
                            {
                                "code": "450223105",
                                "value": "黄冕镇"
                            },
                            {
                                "code": "450223106",
                                "value": "四排镇"
                            },
                            {
                                "code": "450223201",
                                "value": "江口乡"
                            },
                            {
                                "code": "450223202",
                                "value": "导江乡"
                            },
                            {
                                "code": "450223203",
                                "value": "拉沟乡"
                            }
                        ]
                    },
                    {
                        "code": "450224",
                        "value": "融安县",
                        "children": [
                            {
                                "code": "450224100",
                                "value": "长安镇"
                            },
                            {
                                "code": "450224101",
                                "value": "浮石镇"
                            },
                            {
                                "code": "450224102",
                                "value": "泗顶镇"
                            },
                            {
                                "code": "450224103",
                                "value": "板榄镇"
                            },
                            {
                                "code": "450224104",
                                "value": "大将镇"
                            },
                            {
                                "code": "450224105",
                                "value": "大良镇"
                            },
                            {
                                "code": "450224200",
                                "value": "雅瑶乡"
                            },
                            {
                                "code": "450224201",
                                "value": "大坡乡"
                            },
                            {
                                "code": "450224202",
                                "value": "东起乡"
                            },
                            {
                                "code": "450224203",
                                "value": "沙子乡"
                            },
                            {
                                "code": "450224204",
                                "value": "桥板乡"
                            },
                            {
                                "code": "450224205",
                                "value": "潭头乡"
                            }
                        ]
                    },
                    {
                        "code": "450225",
                        "value": "融水苗族自治县",
                        "children": [
                            {
                                "code": "450225100",
                                "value": "融水镇"
                            },
                            {
                                "code": "450225101",
                                "value": "和睦镇"
                            },
                            {
                                "code": "450225102",
                                "value": "三防镇"
                            },
                            {
                                "code": "450225103",
                                "value": "怀宝镇"
                            },
                            {
                                "code": "450225104",
                                "value": "洞头镇"
                            },
                            {
                                "code": "450225105",
                                "value": "大浪镇"
                            },
                            {
                                "code": "450225106",
                                "value": "永乐镇"
                            },
                            {
                                "code": "450225201",
                                "value": "四荣乡"
                            },
                            {
                                "code": "450225202",
                                "value": "香粉乡"
                            },
                            {
                                "code": "450225203",
                                "value": "安太乡"
                            },
                            {
                                "code": "450225205",
                                "value": "汪洞乡"
                            },
                            {
                                "code": "450225206",
                                "value": "同练瑶族乡"
                            },
                            {
                                "code": "450225207",
                                "value": "滚贝侗族乡"
                            },
                            {
                                "code": "450225208",
                                "value": "杆洞乡"
                            },
                            {
                                "code": "450225209",
                                "value": "安陲乡"
                            },
                            {
                                "code": "450225211",
                                "value": "白云乡"
                            },
                            {
                                "code": "450225212",
                                "value": "红水乡"
                            },
                            {
                                "code": "450225213",
                                "value": "拱洞乡"
                            },
                            {
                                "code": "450225214",
                                "value": "良寨乡"
                            },
                            {
                                "code": "450225215",
                                "value": "大年乡"
                            }
                        ]
                    },
                    {
                        "code": "450226",
                        "value": "三江侗族自治县",
                        "children": [
                            {
                                "code": "450226100",
                                "value": "古宜镇"
                            },
                            {
                                "code": "450226101",
                                "value": "斗江镇"
                            },
                            {
                                "code": "450226102",
                                "value": "丹洲镇"
                            },
                            {
                                "code": "450226103",
                                "value": "八江镇"
                            },
                            {
                                "code": "450226104",
                                "value": "林溪镇"
                            },
                            {
                                "code": "450226105",
                                "value": "独峒镇"
                            },
                            {
                                "code": "450226203",
                                "value": "同乐苗族乡"
                            },
                            {
                                "code": "450226204",
                                "value": "梅林乡"
                            },
                            {
                                "code": "450226205",
                                "value": "富禄苗族乡"
                            },
                            {
                                "code": "450226206",
                                "value": "洋溪乡"
                            },
                            {
                                "code": "450226207",
                                "value": "良口乡"
                            },
                            {
                                "code": "450226208",
                                "value": "老堡乡"
                            },
                            {
                                "code": "450226209",
                                "value": "高基瑶族乡"
                            },
                            {
                                "code": "450226210",
                                "value": "和平乡"
                            },
                            {
                                "code": "450226211",
                                "value": "程村乡"
                            }
                        ]
                    }
                ]
            },
            {
                "code": "4503",
                "value": "桂林市",
                "children": [
                    {
                        "code": "450302",
                        "value": "秀峰区",
                        "children": [
                            {
                                "code": "450302001",
                                "value": "秀峰街道"
                            },
                            {
                                "code": "450302002",
                                "value": "丽君街道"
                            },
                            {
                                "code": "450302003",
                                "value": "甲山街道"
                            }
                        ]
                    },
                    {
                        "code": "450303",
                        "value": "叠彩区",
                        "children": [
                            {
                                "code": "450303001",
                                "value": "叠彩街道"
                            },
                            {
                                "code": "450303002",
                                "value": "北门街道"
                            },
                            {
                                "code": "450303200",
                                "value": "大河乡"
                            }
                        ]
                    },
                    {
                        "code": "450304",
                        "value": "象山区",
                        "children": [
                            {
                                "code": "450304001",
                                "value": "南门街道"
                            },
                            {
                                "code": "450304002",
                                "value": "象山街道"
                            },
                            {
                                "code": "450304003",
                                "value": "平山街道"
                            },
                            {
                                "code": "450304200",
                                "value": "二塘乡"
                            }
                        ]
                    },
                    {
                        "code": "450305",
                        "value": "七星区",
                        "children": [
                            {
                                "code": "450305001",
                                "value": "七星区街道"
                            },
                            {
                                "code": "450305002",
                                "value": "东江街道"
                            },
                            {
                                "code": "450305003",
                                "value": "穿山街道"
                            },
                            {
                                "code": "450305004",
                                "value": "漓东街道"
                            },
                            {
                                "code": "450305200",
                                "value": "朝阳乡"
                            },
                            {
                                "code": "450305400",
                                "value": "桂林华侨旅游经济区管理委员会"
                            }
                        ]
                    },
                    {
                        "code": "450311",
                        "value": "雁山区",
                        "children": [
                            {
                                "code": "450311001",
                                "value": "良丰街道"
                            },
                            {
                                "code": "450311100",
                                "value": "雁山镇"
                            },
                            {
                                "code": "450311101",
                                "value": "柘木镇"
                            },
                            {
                                "code": "450311200",
                                "value": "大埠乡"
                            },
                            {
                                "code": "450311201",
                                "value": "草坪回族乡"
                            }
                        ]
                    },
                    {
                        "code": "450312",
                        "value": "临桂区",
                        "children": [
                            {
                                "code": "450312100",
                                "value": "临桂镇"
                            },
                            {
                                "code": "450312101",
                                "value": "六塘镇"
                            },
                            {
                                "code": "450312102",
                                "value": "会仙镇"
                            },
                            {
                                "code": "450312103",
                                "value": "两江镇"
                            },
                            {
                                "code": "450312104",
                                "value": "五通镇"
                            },
                            {
                                "code": "450312105",
                                "value": "四塘镇"
                            },
                            {
                                "code": "450312106",
                                "value": "南边山镇"
                            },
                            {
                                "code": "450312107",
                                "value": "中庸镇"
                            },
                            {
                                "code": "450312108",
                                "value": "茶洞镇"
                            },
                            {
                                "code": "450312204",
                                "value": "宛田瑶族乡"
                            },
                            {
                                "code": "450312205",
                                "value": "黄沙瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "450321",
                        "value": "阳朔县",
                        "children": [
                            {
                                "code": "450321100",
                                "value": "阳朔镇"
                            },
                            {
                                "code": "450321101",
                                "value": "白沙镇"
                            },
                            {
                                "code": "450321102",
                                "value": "福利镇"
                            },
                            {
                                "code": "450321103",
                                "value": "兴坪镇"
                            },
                            {
                                "code": "450321104",
                                "value": "葡萄镇"
                            },
                            {
                                "code": "450321105",
                                "value": "高田镇"
                            },
                            {
                                "code": "450321200",
                                "value": "金宝乡"
                            },
                            {
                                "code": "450321201",
                                "value": "普益乡"
                            },
                            {
                                "code": "450321202",
                                "value": "杨堤乡"
                            }
                        ]
                    },
                    {
                        "code": "450323",
                        "value": "灵川县",
                        "children": [
                            {
                                "code": "450323100",
                                "value": "灵川镇"
                            },
                            {
                                "code": "450323101",
                                "value": "大圩镇"
                            },
                            {
                                "code": "450323102",
                                "value": "定江镇"
                            },
                            {
                                "code": "450323103",
                                "value": "三街镇"
                            },
                            {
                                "code": "450323104",
                                "value": "潭下镇"
                            },
                            {
                                "code": "450323106",
                                "value": "九屋镇"
                            },
                            {
                                "code": "450323107",
                                "value": "灵田镇"
                            },
                            {
                                "code": "450323200",
                                "value": "潮田乡"
                            },
                            {
                                "code": "450323201",
                                "value": "大境瑶族乡"
                            },
                            {
                                "code": "450323202",
                                "value": "海洋乡"
                            },
                            {
                                "code": "450323206",
                                "value": "兰田瑶族乡"
                            },
                            {
                                "code": "450323207",
                                "value": "公平乡"
                            }
                        ]
                    },
                    {
                        "code": "450324",
                        "value": "全州县",
                        "children": [
                            {
                                "code": "450324100",
                                "value": "全州镇"
                            },
                            {
                                "code": "450324101",
                                "value": "黄沙河镇"
                            },
                            {
                                "code": "450324102",
                                "value": "庙头镇"
                            },
                            {
                                "code": "450324103",
                                "value": "文桥镇"
                            },
                            {
                                "code": "450324104",
                                "value": "大西江镇"
                            },
                            {
                                "code": "450324105",
                                "value": "龙水镇"
                            },
                            {
                                "code": "450324106",
                                "value": "才湾镇"
                            },
                            {
                                "code": "450324107",
                                "value": "绍水镇"
                            },
                            {
                                "code": "450324108",
                                "value": "石塘镇"
                            },
                            {
                                "code": "450324109",
                                "value": "咸水镇"
                            },
                            {
                                "code": "450324110",
                                "value": "凤凰镇"
                            },
                            {
                                "code": "450324111",
                                "value": "安和镇"
                            },
                            {
                                "code": "450324112",
                                "value": "两河镇"
                            },
                            {
                                "code": "450324113",
                                "value": "枧塘镇"
                            },
                            {
                                "code": "450324114",
                                "value": "永岁镇"
                            },
                            {
                                "code": "450324204",
                                "value": "蕉江瑶族乡"
                            },
                            {
                                "code": "450324207",
                                "value": "白宝乡"
                            },
                            {
                                "code": "450324208",
                                "value": "东山瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "450325",
                        "value": "兴安县",
                        "children": [
                            {
                                "code": "450325100",
                                "value": "兴安镇"
                            },
                            {
                                "code": "450325101",
                                "value": "湘漓镇"
                            },
                            {
                                "code": "450325102",
                                "value": "界首镇"
                            },
                            {
                                "code": "450325103",
                                "value": "高尚镇"
                            },
                            {
                                "code": "450325104",
                                "value": "严关镇"
                            },
                            {
                                "code": "450325105",
                                "value": "溶江镇"
                            },
                            {
                                "code": "450325200",
                                "value": "漠川乡"
                            },
                            {
                                "code": "450325201",
                                "value": "白石乡"
                            },
                            {
                                "code": "450325202",
                                "value": "崔家乡"
                            },
                            {
                                "code": "450325203",
                                "value": "华江瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "450326",
                        "value": "永福县",
                        "children": [
                            {
                                "code": "450326100",
                                "value": "永福镇"
                            },
                            {
                                "code": "450326101",
                                "value": "罗锦镇"
                            },
                            {
                                "code": "450326102",
                                "value": "百寿镇"
                            },
                            {
                                "code": "450326103",
                                "value": "苏桥镇"
                            },
                            {
                                "code": "450326104",
                                "value": "三皇镇"
                            },
                            {
                                "code": "450326105",
                                "value": "堡里镇"
                            },
                            {
                                "code": "450326202",
                                "value": "广福乡"
                            },
                            {
                                "code": "450326204",
                                "value": "永安乡"
                            },
                            {
                                "code": "450326205",
                                "value": "龙江乡"
                            }
                        ]
                    },
                    {
                        "code": "450327",
                        "value": "灌阳县",
                        "children": [
                            {
                                "code": "450327100",
                                "value": "灌阳镇"
                            },
                            {
                                "code": "450327101",
                                "value": "黄关镇"
                            },
                            {
                                "code": "450327102",
                                "value": "文市镇"
                            },
                            {
                                "code": "450327103",
                                "value": "新街镇"
                            },
                            {
                                "code": "450327104",
                                "value": "新圩镇"
                            },
                            {
                                "code": "450327105",
                                "value": "水车镇"
                            },
                            {
                                "code": "450327200",
                                "value": "洞井瑶族乡"
                            },
                            {
                                "code": "450327201",
                                "value": "观音阁乡"
                            },
                            {
                                "code": "450327202",
                                "value": "西山瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "450328",
                        "value": "龙胜各族自治县",
                        "children": [
                            {
                                "code": "450328100",
                                "value": "龙胜镇"
                            },
                            {
                                "code": "450328101",
                                "value": "瓢里镇"
                            },
                            {
                                "code": "450328102",
                                "value": "三门镇"
                            },
                            {
                                "code": "450328103",
                                "value": "龙脊镇"
                            },
                            {
                                "code": "450328104",
                                "value": "平等镇"
                            },
                            {
                                "code": "450328201",
                                "value": "泗水乡"
                            },
                            {
                                "code": "450328202",
                                "value": "江底乡"
                            },
                            {
                                "code": "450328203",
                                "value": "马堤乡"
                            },
                            {
                                "code": "450328204",
                                "value": "伟江乡"
                            },
                            {
                                "code": "450328206",
                                "value": "乐江乡"
                            }
                        ]
                    },
                    {
                        "code": "450329",
                        "value": "资源县",
                        "children": [
                            {
                                "code": "450329100",
                                "value": "资源镇"
                            },
                            {
                                "code": "450329101",
                                "value": "中峰镇"
                            },
                            {
                                "code": "450329102",
                                "value": "梅溪镇"
                            },
                            {
                                "code": "450329202",
                                "value": "瓜里乡"
                            },
                            {
                                "code": "450329203",
                                "value": "车田苗族乡"
                            },
                            {
                                "code": "450329204",
                                "value": "两水苗族乡"
                            },
                            {
                                "code": "450329205",
                                "value": "河口瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "450330",
                        "value": "平乐县",
                        "children": [
                            {
                                "code": "450330100",
                                "value": "平乐镇"
                            },
                            {
                                "code": "450330101",
                                "value": "二塘镇"
                            },
                            {
                                "code": "450330102",
                                "value": "沙子镇"
                            },
                            {
                                "code": "450330103",
                                "value": "同安镇"
                            },
                            {
                                "code": "450330104",
                                "value": "张家镇"
                            },
                            {
                                "code": "450330105",
                                "value": "源头镇"
                            },
                            {
                                "code": "450330200",
                                "value": "阳安乡"
                            },
                            {
                                "code": "450330201",
                                "value": "青龙乡"
                            },
                            {
                                "code": "450330202",
                                "value": "桥亭乡"
                            },
                            {
                                "code": "450330203",
                                "value": "大发瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "450331",
                        "value": "荔浦县",
                        "children": [
                            {
                                "code": "450331100",
                                "value": "荔城镇"
                            },
                            {
                                "code": "450331101",
                                "value": "东昌镇"
                            },
                            {
                                "code": "450331102",
                                "value": "新坪镇"
                            },
                            {
                                "code": "450331103",
                                "value": "杜莫镇"
                            },
                            {
                                "code": "450331104",
                                "value": "青山镇"
                            },
                            {
                                "code": "450331105",
                                "value": "修仁镇"
                            },
                            {
                                "code": "450331106",
                                "value": "大塘镇"
                            },
                            {
                                "code": "450331107",
                                "value": "花箦镇"
                            },
                            {
                                "code": "450331108",
                                "value": "双江镇"
                            },
                            {
                                "code": "450331109",
                                "value": "马岭镇"
                            },
                            {
                                "code": "450331200",
                                "value": "龙怀乡"
                            },
                            {
                                "code": "450331201",
                                "value": "茶城乡"
                            },
                            {
                                "code": "450331202",
                                "value": "蒲芦瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "450332",
                        "value": "恭城瑶族自治县",
                        "children": [
                            {
                                "code": "450332100",
                                "value": "恭城镇"
                            },
                            {
                                "code": "450332101",
                                "value": "栗木镇"
                            },
                            {
                                "code": "450332102",
                                "value": "莲花镇"
                            },
                            {
                                "code": "450332103",
                                "value": "嘉会镇"
                            },
                            {
                                "code": "450332104",
                                "value": "西岭镇"
                            },
                            {
                                "code": "450332200",
                                "value": "平安乡"
                            },
                            {
                                "code": "450332201",
                                "value": "三江乡"
                            },
                            {
                                "code": "450332204",
                                "value": "观音乡"
                            },
                            {
                                "code": "450332205",
                                "value": "龙虎乡"
                            }
                        ]
                    }
                ]
            },
            {
                "code": "4504",
                "value": "梧州市",
                "children": [
                    {
                        "code": "450403",
                        "value": "万秀区",
                        "children": [
                            {
                                "code": "450403001",
                                "value": "城东街道"
                            },
                            {
                                "code": "450403002",
                                "value": "城南街道"
                            },
                            {
                                "code": "450403003",
                                "value": "城中办街道事处"
                            },
                            {
                                "code": "450403004",
                                "value": "城北办街道事处"
                            },
                            {
                                "code": "450403005",
                                "value": "角嘴街道"
                            },
                            {
                                "code": "450403006",
                                "value": "东兴街道"
                            },
                            {
                                "code": "450403007",
                                "value": "富民街道"
                            },
                            {
                                "code": "450403101",
                                "value": "城东镇"
                            },
                            {
                                "code": "450403103",
                                "value": "龙湖镇"
                            },
                            {
                                "code": "450403104",
                                "value": "夏郢镇"
                            }
                        ]
                    },
                    {
                        "code": "450405",
                        "value": "长洲区",
                        "children": [
                            {
                                "code": "450405001",
                                "value": "大塘街道"
                            },
                            {
                                "code": "450405002",
                                "value": "兴龙街道"
                            },
                            {
                                "code": "450405101",
                                "value": "长洲镇"
                            },
                            {
                                "code": "450405102",
                                "value": "倒水镇"
                            }
                        ]
                    },
                    {
                        "code": "450406",
                        "value": "龙圩区",
                        "children": [
                            {
                                "code": "450406100",
                                "value": "龙圩镇"
                            },
                            {
                                "code": "450406101",
                                "value": "大坡镇"
                            },
                            {
                                "code": "450406102",
                                "value": "广平镇"
                            },
                            {
                                "code": "450406103",
                                "value": "新地镇"
                            }
                        ]
                    },
                    {
                        "code": "450421",
                        "value": "苍梧县",
                        "children": [
                            {
                                "code": "450421100",
                                "value": "石桥镇"
                            },
                            {
                                "code": "450421101",
                                "value": "沙头镇"
                            },
                            {
                                "code": "450421102",
                                "value": "梨埠镇"
                            },
                            {
                                "code": "450421105",
                                "value": "岭脚镇"
                            },
                            {
                                "code": "450421108",
                                "value": "京南镇"
                            },
                            {
                                "code": "450421109",
                                "value": "狮寨镇"
                            },
                            {
                                "code": "450421110",
                                "value": "旺甫镇"
                            },
                            {
                                "code": "450421112",
                                "value": "六堡镇"
                            },
                            {
                                "code": "450421114",
                                "value": "木双镇"
                            }
                        ]
                    },
                    {
                        "code": "450422",
                        "value": "藤县",
                        "children": [
                            {
                                "code": "450422100",
                                "value": "藤州镇"
                            },
                            {
                                "code": "450422103",
                                "value": "塘步镇"
                            },
                            {
                                "code": "450422104",
                                "value": "埌南镇"
                            },
                            {
                                "code": "450422105",
                                "value": "同心镇"
                            },
                            {
                                "code": "450422106",
                                "value": "金鸡镇"
                            },
                            {
                                "code": "450422107",
                                "value": "新庆镇"
                            },
                            {
                                "code": "450422108",
                                "value": "象棋镇"
                            },
                            {
                                "code": "450422109",
                                "value": "岭景镇"
                            },
                            {
                                "code": "450422110",
                                "value": "天平镇"
                            },
                            {
                                "code": "450422111",
                                "value": "蒙江镇"
                            },
                            {
                                "code": "450422112",
                                "value": "和平镇"
                            },
                            {
                                "code": "450422113",
                                "value": "太平镇"
                            },
                            {
                                "code": "450422114",
                                "value": "古龙镇"
                            },
                            {
                                "code": "450422115",
                                "value": "东荣镇"
                            },
                            {
                                "code": "450422116",
                                "value": "大黎镇"
                            },
                            {
                                "code": "450422200",
                                "value": "平福乡"
                            },
                            {
                                "code": "450422201",
                                "value": "宁康乡"
                            }
                        ]
                    },
                    {
                        "code": "450423",
                        "value": "蒙山县",
                        "children": [
                            {
                                "code": "450423100",
                                "value": "蒙山镇"
                            },
                            {
                                "code": "450423101",
                                "value": "西河镇"
                            },
                            {
                                "code": "450423102",
                                "value": "新圩镇"
                            },
                            {
                                "code": "450423103",
                                "value": "文圩镇"
                            },
                            {
                                "code": "450423104",
                                "value": "黄村镇"
                            },
                            {
                                "code": "450423105",
                                "value": "陈塘镇"
                            },
                            {
                                "code": "450423200",
                                "value": "汉豪乡"
                            },
                            {
                                "code": "450423201",
                                "value": "长坪瑶族乡"
                            },
                            {
                                "code": "450423202",
                                "value": "夏宜瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "450481",
                        "value": "岑溪市",
                        "children": [
                            {
                                "code": "450481100",
                                "value": "岑城镇"
                            },
                            {
                                "code": "450481102",
                                "value": "马路镇"
                            },
                            {
                                "code": "450481103",
                                "value": "南渡镇"
                            },
                            {
                                "code": "450481105",
                                "value": "水汶镇"
                            },
                            {
                                "code": "450481106",
                                "value": "大隆镇"
                            },
                            {
                                "code": "450481107",
                                "value": "梨木镇"
                            },
                            {
                                "code": "450481108",
                                "value": "大业镇"
                            },
                            {
                                "code": "450481109",
                                "value": "筋竹镇"
                            },
                            {
                                "code": "450481110",
                                "value": "诚谏镇"
                            },
                            {
                                "code": "450481111",
                                "value": "归义镇"
                            },
                            {
                                "code": "450481112",
                                "value": "糯垌镇"
                            },
                            {
                                "code": "450481113",
                                "value": "安平镇"
                            },
                            {
                                "code": "450481114",
                                "value": "三堡镇"
                            },
                            {
                                "code": "450481115",
                                "value": "波塘镇"
                            }
                        ]
                    }
                ]
            },
            {
                "code": "4505",
                "value": "北海市",
                "children": [
                    {
                        "code": "450502",
                        "value": "海城区",
                        "children": [
                            {
                                "code": "450502001",
                                "value": "中街街道"
                            },
                            {
                                "code": "450502002",
                                "value": "东街街道"
                            },
                            {
                                "code": "450502003",
                                "value": "西街街道"
                            },
                            {
                                "code": "450502004",
                                "value": "海角街道"
                            },
                            {
                                "code": "450502005",
                                "value": "地角街道"
                            },
                            {
                                "code": "450502006",
                                "value": "高德街道"
                            },
                            {
                                "code": "450502007",
                                "value": "驿马街道"
                            },
                            {
                                "code": "450502100",
                                "value": "涠洲镇"
                            }
                        ]
                    },
                    {
                        "code": "450503",
                        "value": "银海区",
                        "children": [
                            {
                                "code": "450503100",
                                "value": "福成镇"
                            },
                            {
                                "code": "450503101",
                                "value": "银滩镇"
                            },
                            {
                                "code": "450503102",
                                "value": "平阳镇"
                            },
                            {
                                "code": "450503103",
                                "value": "侨港镇"
                            }
                        ]
                    },
                    {
                        "code": "450512",
                        "value": "铁山港区",
                        "children": [
                            {
                                "code": "450512100",
                                "value": "南康镇"
                            },
                            {
                                "code": "450512101",
                                "value": "营盘镇"
                            },
                            {
                                "code": "450512102",
                                "value": "兴港镇"
                            }
                        ]
                    },
                    {
                        "code": "450521",
                        "value": "合浦县",
                        "children": [
                            {
                                "code": "450521100",
                                "value": "廉州镇"
                            },
                            {
                                "code": "450521101",
                                "value": "党江镇"
                            },
                            {
                                "code": "450521102",
                                "value": "西场镇"
                            },
                            {
                                "code": "450521103",
                                "value": "沙岗镇"
                            },
                            {
                                "code": "450521104",
                                "value": "乌家镇"
                            },
                            {
                                "code": "450521105",
                                "value": "闸口镇"
                            },
                            {
                                "code": "450521106",
                                "value": "公馆镇"
                            },
                            {
                                "code": "450521107",
                                "value": "白沙镇"
                            },
                            {
                                "code": "450521108",
                                "value": "山口镇"
                            },
                            {
                                "code": "450521109",
                                "value": "沙田镇"
                            },
                            {
                                "code": "450521110",
                                "value": "石湾镇"
                            },
                            {
                                "code": "450521111",
                                "value": "石康镇"
                            },
                            {
                                "code": "450521112",
                                "value": "常乐镇"
                            },
                            {
                                "code": "450521113",
                                "value": "星岛湖镇"
                            },
                            {
                                "code": "450521200",
                                "value": "曲樟乡"
                            }
                        ]
                    }
                ]
            },
            {
                "code": "4506",
                "value": "防城港市",
                "children": [
                    {
                        "code": "450602",
                        "value": "港口区",
                        "children": [
                            {
                                "code": "450602001",
                                "value": "渔州坪街道"
                            },
                            {
                                "code": "450602002",
                                "value": "白沙万街道"
                            },
                            {
                                "code": "450602003",
                                "value": "沙潭江街道"
                            },
                            {
                                "code": "450602004",
                                "value": "王府街道"
                            },
                            {
                                "code": "450602100",
                                "value": "企沙镇"
                            },
                            {
                                "code": "450602101",
                                "value": "光坡镇"
                            }
                        ]
                    },
                    {
                        "code": "450603",
                        "value": "防城区",
                        "children": [
                            {
                                "code": "450603001",
                                "value": "水营街道"
                            },
                            {
                                "code": "450603002",
                                "value": "珠河街道"
                            },
                            {
                                "code": "450603003",
                                "value": "文昌街道"
                            },
                            {
                                "code": "450603101",
                                "value": "大菉镇"
                            },
                            {
                                "code": "450603102",
                                "value": "华石镇"
                            },
                            {
                                "code": "450603103",
                                "value": "那梭镇"
                            },
                            {
                                "code": "450603104",
                                "value": "那良镇"
                            },
                            {
                                "code": "450603105",
                                "value": "峒中镇"
                            },
                            {
                                "code": "450603106",
                                "value": "江山镇"
                            },
                            {
                                "code": "450603107",
                                "value": "茅岭镇"
                            },
                            {
                                "code": "450603108",
                                "value": "扶隆镇"
                            },
                            {
                                "code": "450603203",
                                "value": "防城区滩营乡"
                            },
                            {
                                "code": "450603209",
                                "value": "十万山瑶族乡"
                            },
                            {
                                "code": "450603450",
                                "value": "小峰经济作物场"
                            },
                            {
                                "code": "450603451",
                                "value": "荣光农场"
                            },
                            {
                                "code": "450603453",
                                "value": "垌美农场"
                            },
                            {
                                "code": "450603454",
                                "value": "那梭农场"
                            }
                        ]
                    },
                    {
                        "code": "450621",
                        "value": "上思县",
                        "children": [
                            {
                                "code": "450621100",
                                "value": "思阳镇"
                            },
                            {
                                "code": "450621101",
                                "value": "在妙镇"
                            },
                            {
                                "code": "450621102",
                                "value": "华兰镇"
                            },
                            {
                                "code": "450621103",
                                "value": "叫安镇"
                            },
                            {
                                "code": "450621203",
                                "value": "南屏瑶族乡"
                            },
                            {
                                "code": "450621204",
                                "value": "平福乡"
                            },
                            {
                                "code": "450621205",
                                "value": "那琴乡"
                            },
                            {
                                "code": "450621206",
                                "value": "公正乡"
                            },
                            {
                                "code": "450621450",
                                "value": "国有昌菱农场"
                            }
                        ]
                    },
                    {
                        "code": "450681",
                        "value": "东兴市",
                        "children": [
                            {
                                "code": "450681100",
                                "value": "东兴镇"
                            },
                            {
                                "code": "450681101",
                                "value": "江平镇"
                            },
                            {
                                "code": "450681102",
                                "value": "马路镇"
                            }
                        ]
                    }
                ]
            },
            {
                "code": "4507",
                "value": "钦州市",
                "children": [
                    {
                        "code": "450702",
                        "value": "钦南区",
                        "children": [
                            {
                                "code": "450702001",
                                "value": "向阳街道"
                            },
                            {
                                "code": "450702002",
                                "value": "水东街道"
                            },
                            {
                                "code": "450702003",
                                "value": "文峰街道"
                            },
                            {
                                "code": "450702004",
                                "value": "南珠街道"
                            },
                            {
                                "code": "450702005",
                                "value": "尖山街道"
                            },
                            {
                                "code": "450702100",
                                "value": "沙埠镇"
                            },
                            {
                                "code": "450702101",
                                "value": "康熙岭镇"
                            },
                            {
                                "code": "450702102",
                                "value": "黄屋屯镇"
                            },
                            {
                                "code": "450702104",
                                "value": "大番坡镇"
                            },
                            {
                                "code": "450702105",
                                "value": "龙门港镇"
                            },
                            {
                                "code": "450702107",
                                "value": "久隆镇"
                            },
                            {
                                "code": "450702108",
                                "value": "东场镇"
                            },
                            {
                                "code": "450702109",
                                "value": "那丽镇"
                            },
                            {
                                "code": "450702110",
                                "value": "那彭镇"
                            },
                            {
                                "code": "450702111",
                                "value": "那思镇"
                            },
                            {
                                "code": "450702112",
                                "value": "犀牛脚镇"
                            },
                            {
                                "code": "450702400",
                                "value": "丽光华侨农场"
                            },
                            {
                                "code": "450702401",
                                "value": "钦州港经济技术开发区"
                            },
                            {
                                "code": "450702402",
                                "value": "三娘湾旅游管理区"
                            },
                            {
                                "code": "450702403",
                                "value": "广西钦州保税港区"
                            },
                            {
                                "code": "450702404",
                                "value": "中马钦州产业园区"
                            }
                        ]
                    },
                    {
                        "code": "450703",
                        "value": "钦北区",
                        "children": [
                            {
                                "code": "450703001",
                                "value": "长田街道"
                            },
                            {
                                "code": "450703002",
                                "value": "鸿亭街道"
                            },
                            {
                                "code": "450703003",
                                "value": "子材街道"
                            },
                            {
                                "code": "450703100",
                                "value": "大垌镇"
                            },
                            {
                                "code": "450703101",
                                "value": "平吉镇"
                            },
                            {
                                "code": "450703102",
                                "value": "青塘镇"
                            },
                            {
                                "code": "450703103",
                                "value": "小董镇"
                            },
                            {
                                "code": "450703104",
                                "value": "板城镇"
                            },
                            {
                                "code": "450703105",
                                "value": "那蒙镇"
                            },
                            {
                                "code": "450703106",
                                "value": "长滩镇"
                            },
                            {
                                "code": "450703107",
                                "value": "新棠镇"
                            },
                            {
                                "code": "450703108",
                                "value": "大直镇"
                            },
                            {
                                "code": "450703109",
                                "value": "大寺镇"
                            },
                            {
                                "code": "450703110",
                                "value": "贵台镇"
                            }
                        ]
                    },
                    {
                        "code": "450721",
                        "value": "灵山县",
                        "children": [
                            {
                                "code": "450721001",
                                "value": "灵城街道"
                            },
                            {
                                "code": "450721002",
                                "value": "三海街道"
                            },
                            {
                                "code": "450721101",
                                "value": "新圩镇"
                            },
                            {
                                "code": "450721102",
                                "value": "丰塘镇"
                            },
                            {
                                "code": "450721103",
                                "value": "平山镇"
                            },
                            {
                                "code": "450721104",
                                "value": "石塘镇"
                            },
                            {
                                "code": "450721105",
                                "value": "佛子镇"
                            },
                            {
                                "code": "450721106",
                                "value": "平南镇"
                            },
                            {
                                "code": "450721107",
                                "value": "烟墩镇"
                            },
                            {
                                "code": "450721108",
                                "value": "檀圩镇"
                            },
                            {
                                "code": "450721109",
                                "value": "那隆镇"
                            },
                            {
                                "code": "450721110",
                                "value": "三隆镇"
                            },
                            {
                                "code": "450721111",
                                "value": "陆屋镇"
                            },
                            {
                                "code": "450721112",
                                "value": "旧州镇"
                            },
                            {
                                "code": "450721113",
                                "value": "太平镇"
                            },
                            {
                                "code": "450721114",
                                "value": "沙坪镇"
                            },
                            {
                                "code": "450721115",
                                "value": "武利镇"
                            },
                            {
                                "code": "450721116",
                                "value": "文利镇"
                            },
                            {
                                "code": "450721117",
                                "value": "伯劳镇"
                            },
                            {
                                "code": "450721400",
                                "value": "国营新光农场"
                            },
                            {
                                "code": "450721401",
                                "value": "国营华山农场"
                            }
                        ]
                    },
                    {
                        "code": "450722",
                        "value": "浦北县",
                        "children": [
                            {
                                "code": "450722001",
                                "value": "小江街道"
                            },
                            {
                                "code": "450722002",
                                "value": "江城街道"
                            },
                            {
                                "code": "450722101",
                                "value": "泉水镇"
                            },
                            {
                                "code": "450722102",
                                "value": "石埇镇"
                            },
                            {
                                "code": "450722103",
                                "value": "安石镇"
                            },
                            {
                                "code": "450722104",
                                "value": "张黄镇"
                            },
                            {
                                "code": "450722105",
                                "value": "大成镇"
                            },
                            {
                                "code": "450722106",
                                "value": "白石水镇"
                            },
                            {
                                "code": "450722107",
                                "value": "北通镇"
                            },
                            {
                                "code": "450722108",
                                "value": "三合镇"
                            },
                            {
                                "code": "450722109",
                                "value": "龙门镇"
                            },
                            {
                                "code": "450722110",
                                "value": "福旺镇"
                            },
                            {
                                "code": "450722111",
                                "value": "寨圩镇"
                            },
                            {
                                "code": "450722112",
                                "value": "乐民镇"
                            },
                            {
                                "code": "450722113",
                                "value": "六硍镇"
                            },
                            {
                                "code": "450722114",
                                "value": "平睦镇"
                            },
                            {
                                "code": "450722115",
                                "value": "官垌镇"
                            }
                        ]
                    }
                ]
            },
            {
                "code": "4508",
                "value": "贵港市",
                "children": [
                    {
                        "code": "450802",
                        "value": "港北区",
                        "children": [
                            {
                                "code": "450802001",
                                "value": "贵城街道"
                            },
                            {
                                "code": "450802100",
                                "value": "港城镇"
                            },
                            {
                                "code": "450802101",
                                "value": "大圩镇"
                            },
                            {
                                "code": "450802102",
                                "value": "庆丰镇"
                            },
                            {
                                "code": "450802103",
                                "value": "根竹镇"
                            },
                            {
                                "code": "450802104",
                                "value": "武乐镇"
                            },
                            {
                                "code": "450802200",
                                "value": "奇石乡"
                            },
                            {
                                "code": "450802201",
                                "value": "中里乡"
                            }
                        ]
                    },
                    {
                        "code": "450803",
                        "value": "港南区",
                        "children": [
                            {
                                "code": "450803001",
                                "value": "江南街道"
                            },
                            {
                                "code": "450803002",
                                "value": "八塘街道"
                            },
                            {
                                "code": "450803100",
                                "value": "桥圩镇"
                            },
                            {
                                "code": "450803101",
                                "value": "木格镇"
                            },
                            {
                                "code": "450803102",
                                "value": "木梓镇"
                            },
                            {
                                "code": "450803103",
                                "value": "湛江镇"
                            },
                            {
                                "code": "450803104",
                                "value": "东津镇"
                            },
                            {
                                "code": "450803106",
                                "value": "新塘镇"
                            },
                            {
                                "code": "450803107",
                                "value": "瓦塘镇"
                            }
                        ]
                    },
                    {
                        "code": "450804",
                        "value": "覃塘区",
                        "children": [
                            {
                                "code": "450804100",
                                "value": "覃塘镇"
                            },
                            {
                                "code": "450804101",
                                "value": "东龙镇"
                            },
                            {
                                "code": "450804102",
                                "value": "三里镇"
                            },
                            {
                                "code": "450804103",
                                "value": "黄练镇"
                            },
                            {
                                "code": "450804104",
                                "value": "石卡镇"
                            },
                            {
                                "code": "450804105",
                                "value": "五里镇"
                            },
                            {
                                "code": "450804106",
                                "value": "樟木镇"
                            },
                            {
                                "code": "450804107",
                                "value": "蒙公镇"
                            },
                            {
                                "code": "450804200",
                                "value": "山北乡"
                            },
                            {
                                "code": "450804204",
                                "value": "大岭乡"
                            }
                        ]
                    },
                    {
                        "code": "450821",
                        "value": "平南县",
                        "children": [
                            {
                                "code": "450821100",
                                "value": "平南镇"
                            },
                            {
                                "code": "450821101",
                                "value": "平山镇"
                            },
                            {
                                "code": "450821102",
                                "value": "寺面镇"
                            },
                            {
                                "code": "450821103",
                                "value": "六陈镇"
                            },
                            {
                                "code": "450821104",
                                "value": "大新镇"
                            },
                            {
                                "code": "450821105",
                                "value": "大安镇"
                            },
                            {
                                "code": "450821106",
                                "value": "武林镇"
                            },
                            {
                                "code": "450821107",
                                "value": "大坡镇"
                            },
                            {
                                "code": "450821108",
                                "value": "大洲镇"
                            },
                            {
                                "code": "450821109",
                                "value": "镇隆镇"
                            },
                            {
                                "code": "450821110",
                                "value": "上渡镇"
                            },
                            {
                                "code": "450821112",
                                "value": "安怀镇"
                            },
                            {
                                "code": "450821113",
                                "value": "丹竹镇"
                            },
                            {
                                "code": "450821114",
                                "value": "官成镇"
                            },
                            {
                                "code": "450821115",
                                "value": "思旺镇"
                            },
                            {
                                "code": "450821116",
                                "value": "大鹏镇"
                            },
                            {
                                "code": "450821117",
                                "value": "同和镇"
                            },
                            {
                                "code": "450821118",
                                "value": "东华镇"
                            },
                            {
                                "code": "450821204",
                                "value": "思界乡"
                            },
                            {
                                "code": "450821205",
                                "value": "国安瑶族乡"
                            },
                            {
                                "code": "450821206",
                                "value": "马练瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "450881",
                        "value": "桂平市",
                        "children": [
                            {
                                "code": "450881101",
                                "value": "木乐镇"
                            },
                            {
                                "code": "450881102",
                                "value": "木圭镇"
                            },
                            {
                                "code": "450881103",
                                "value": "石咀镇"
                            },
                            {
                                "code": "450881104",
                                "value": "油麻镇"
                            },
                            {
                                "code": "450881105",
                                "value": "社坡镇"
                            },
                            {
                                "code": "450881106",
                                "value": "罗秀镇"
                            },
                            {
                                "code": "450881107",
                                "value": "麻垌镇"
                            },
                            {
                                "code": "450881108",
                                "value": "社步镇"
                            },
                            {
                                "code": "450881109",
                                "value": "下湾镇"
                            },
                            {
                                "code": "450881110",
                                "value": "木根镇"
                            },
                            {
                                "code": "450881111",
                                "value": "中沙镇"
                            },
                            {
                                "code": "450881113",
                                "value": "大洋镇"
                            },
                            {
                                "code": "450881114",
                                "value": "大湾镇"
                            },
                            {
                                "code": "450881115",
                                "value": "白沙镇"
                            },
                            {
                                "code": "450881116",
                                "value": "石龙镇"
                            },
                            {
                                "code": "450881117",
                                "value": "蒙圩镇"
                            },
                            {
                                "code": "450881118",
                                "value": "西山镇"
                            },
                            {
                                "code": "450881119",
                                "value": "南木镇"
                            },
                            {
                                "code": "450881120",
                                "value": "江口镇"
                            },
                            {
                                "code": "450881121",
                                "value": "金田镇"
                            },
                            {
                                "code": "450881122",
                                "value": "紫荆镇"
                            },
                            {
                                "code": "450881200",
                                "value": "马皮乡"
                            },
                            {
                                "code": "450881202",
                                "value": "寻旺乡"
                            },
                            {
                                "code": "450881203",
                                "value": "罗播乡"
                            },
                            {
                                "code": "450881204",
                                "value": "厚禄乡"
                            },
                            {
                                "code": "450881206",
                                "value": "垌心乡"
                            }
                        ]
                    }
                ]
            },
            {
                "code": "4509",
                "value": "玉林市",
                "children": [
                    {
                        "code": "450902",
                        "value": "玉州区",
                        "children": [
                            {
                                "code": "450902001",
                                "value": "玉城街道"
                            },
                            {
                                "code": "450902002",
                                "value": "南江街道"
                            },
                            {
                                "code": "450902003",
                                "value": "城西街道"
                            },
                            {
                                "code": "450902004",
                                "value": "城北街道"
                            },
                            {
                                "code": "450902005",
                                "value": "名山街道"
                            },
                            {
                                "code": "450902100",
                                "value": "大塘镇"
                            },
                            {
                                "code": "450902105",
                                "value": "茂林镇"
                            },
                            {
                                "code": "450902106",
                                "value": "仁东镇"
                            },
                            {
                                "code": "450902113",
                                "value": "仁厚镇"
                            }
                        ]
                    },
                    {
                        "code": "450903",
                        "value": "福绵区",
                        "children": [
                            {
                                "code": "450903107",
                                "value": "福绵镇"
                            },
                            {
                                "code": "450903108",
                                "value": "成均镇"
                            },
                            {
                                "code": "450903109",
                                "value": "樟木镇"
                            },
                            {
                                "code": "450903110",
                                "value": "新桥镇"
                            },
                            {
                                "code": "450903111",
                                "value": "沙田镇"
                            },
                            {
                                "code": "450903112",
                                "value": "石和镇"
                            }
                        ]
                    },
                    {
                        "code": "450921",
                        "value": "容县",
                        "children": [
                            {
                                "code": "450921100",
                                "value": "容州镇"
                            },
                            {
                                "code": "450921102",
                                "value": "杨梅镇"
                            },
                            {
                                "code": "450921103",
                                "value": "灵山镇"
                            },
                            {
                                "code": "450921104",
                                "value": "六王镇"
                            },
                            {
                                "code": "450921105",
                                "value": "黎村镇"
                            },
                            {
                                "code": "450921106",
                                "value": "杨村镇"
                            },
                            {
                                "code": "450921107",
                                "value": "县底镇"
                            },
                            {
                                "code": "450921108",
                                "value": "自良镇"
                            },
                            {
                                "code": "450921109",
                                "value": "松山镇"
                            },
                            {
                                "code": "450921110",
                                "value": "罗江镇"
                            },
                            {
                                "code": "450921111",
                                "value": "石头镇"
                            },
                            {
                                "code": "450921112",
                                "value": "石寨镇"
                            },
                            {
                                "code": "450921113",
                                "value": "十里镇"
                            },
                            {
                                "code": "450921114",
                                "value": "容西镇"
                            },
                            {
                                "code": "450921115",
                                "value": "浪水镇"
                            }
                        ]
                    },
                    {
                        "code": "450922",
                        "value": "陆川县",
                        "children": [
                            {
                                "code": "450922101",
                                "value": "温泉镇"
                            },
                            {
                                "code": "450922102",
                                "value": "米场镇"
                            },
                            {
                                "code": "450922103",
                                "value": "马坡镇"
                            },
                            {
                                "code": "450922104",
                                "value": "珊罗镇"
                            },
                            {
                                "code": "450922105",
                                "value": "平乐镇"
                            },
                            {
                                "code": "450922106",
                                "value": "沙坡镇"
                            },
                            {
                                "code": "450922107",
                                "value": "大桥镇"
                            },
                            {
                                "code": "450922108",
                                "value": "乌石镇"
                            },
                            {
                                "code": "450922109",
                                "value": "良田镇"
                            },
                            {
                                "code": "450922110",
                                "value": "清湖镇"
                            },
                            {
                                "code": "450922111",
                                "value": "古城镇"
                            },
                            {
                                "code": "450922112",
                                "value": "沙湖镇"
                            },
                            {
                                "code": "450922113",
                                "value": "横山镇"
                            },
                            {
                                "code": "450922114",
                                "value": "滩面镇"
                            }
                        ]
                    },
                    {
                        "code": "450923",
                        "value": "博白县",
                        "children": [
                            {
                                "code": "450923100",
                                "value": "博白镇"
                            },
                            {
                                "code": "450923102",
                                "value": "双凤镇"
                            },
                            {
                                "code": "450923105",
                                "value": "顿谷镇"
                            },
                            {
                                "code": "450923106",
                                "value": "水鸣镇"
                            },
                            {
                                "code": "450923107",
                                "value": "那林镇"
                            },
                            {
                                "code": "450923108",
                                "value": "江宁镇"
                            },
                            {
                                "code": "450923109",
                                "value": "三滩镇"
                            },
                            {
                                "code": "450923110",
                                "value": "黄凌镇"
                            },
                            {
                                "code": "450923111",
                                "value": "亚山镇"
                            },
                            {
                                "code": "450923112",
                                "value": "旺茂镇"
                            },
                            {
                                "code": "450923114",
                                "value": "东平镇"
                            },
                            {
                                "code": "450923115",
                                "value": "沙河镇"
                            },
                            {
                                "code": "450923116",
                                "value": "菱角镇"
                            },
                            {
                                "code": "450923117",
                                "value": "新田镇"
                            },
                            {
                                "code": "450923118",
                                "value": "凤山镇"
                            },
                            {
                                "code": "450923119",
                                "value": "宁潭镇"
                            },
                            {
                                "code": "450923120",
                                "value": "文地镇"
                            },
                            {
                                "code": "450923121",
                                "value": "英桥镇"
                            },
                            {
                                "code": "450923122",
                                "value": "那卜镇"
                            },
                            {
                                "code": "450923123",
                                "value": "大垌镇"
                            },
                            {
                                "code": "450923124",
                                "value": "沙陂镇"
                            },
                            {
                                "code": "450923125",
                                "value": "双旺镇"
                            },
                            {
                                "code": "450923126",
                                "value": "松旺镇"
                            },
                            {
                                "code": "450923127",
                                "value": "龙潭镇"
                            },
                            {
                                "code": "450923128",
                                "value": "大坝镇"
                            },
                            {
                                "code": "450923129",
                                "value": "永安镇"
                            },
                            {
                                "code": "450923130",
                                "value": "径口镇"
                            },
                            {
                                "code": "450923131",
                                "value": "浪平镇"
                            }
                        ]
                    },
                    {
                        "code": "450924",
                        "value": "兴业县",
                        "children": [
                            {
                                "code": "450924100",
                                "value": "石南镇"
                            },
                            {
                                "code": "450924101",
                                "value": "大平山镇"
                            },
                            {
                                "code": "450924102",
                                "value": "葵阳镇"
                            },
                            {
                                "code": "450924103",
                                "value": "城隍镇"
                            },
                            {
                                "code": "450924104",
                                "value": "山心镇"
                            },
                            {
                                "code": "450924105",
                                "value": "沙塘镇"
                            },
                            {
                                "code": "450924106",
                                "value": "蒲塘镇"
                            },
                            {
                                "code": "450924107",
                                "value": "北市镇"
                            },
                            {
                                "code": "450924108",
                                "value": "龙安镇"
                            },
                            {
                                "code": "450924109",
                                "value": "高峰镇"
                            },
                            {
                                "code": "450924110",
                                "value": "小平山镇"
                            },
                            {
                                "code": "450924111",
                                "value": "卖酒镇"
                            },
                            {
                                "code": "450924112",
                                "value": "洛阳镇"
                            }
                        ]
                    },
                    {
                        "code": "450981",
                        "value": "北流市",
                        "children": [
                            {
                                "code": "450981001",
                                "value": "陵城街道"
                            },
                            {
                                "code": "450981002",
                                "value": "城南街道"
                            },
                            {
                                "code": "450981003",
                                "value": "城北街道"
                            },
                            {
                                "code": "450981100",
                                "value": "北流镇"
                            },
                            {
                                "code": "450981101",
                                "value": "新荣镇"
                            },
                            {
                                "code": "450981102",
                                "value": "民安镇"
                            },
                            {
                                "code": "450981103",
                                "value": "山围镇"
                            },
                            {
                                "code": "450981104",
                                "value": "民乐镇"
                            },
                            {
                                "code": "450981105",
                                "value": "西埌镇"
                            },
                            {
                                "code": "450981106",
                                "value": "新圩镇"
                            },
                            {
                                "code": "450981107",
                                "value": "大里镇"
                            },
                            {
                                "code": "450981108",
                                "value": "塘岸镇"
                            },
                            {
                                "code": "450981109",
                                "value": "清水口镇"
                            },
                            {
                                "code": "450981110",
                                "value": "隆盛镇"
                            },
                            {
                                "code": "450981111",
                                "value": "大坡外镇"
                            },
                            {
                                "code": "450981112",
                                "value": "六麻镇"
                            },
                            {
                                "code": "450981113",
                                "value": "新丰镇"
                            },
                            {
                                "code": "450981114",
                                "value": "沙垌镇"
                            },
                            {
                                "code": "450981115",
                                "value": "平政镇"
                            },
                            {
                                "code": "450981116",
                                "value": "白马镇"
                            },
                            {
                                "code": "450981117",
                                "value": "大伦镇"
                            },
                            {
                                "code": "450981118",
                                "value": "扶新镇"
                            },
                            {
                                "code": "450981119",
                                "value": "六靖镇"
                            },
                            {
                                "code": "450981120",
                                "value": "石窝镇"
                            },
                            {
                                "code": "450981121",
                                "value": "清湾镇"
                            }
                        ]
                    }
                ]
            },
            {
                "code": "4510",
                "value": "百色市",
                "children": [
                    {
                        "code": "451002",
                        "value": "右江区",
                        "children": [
                            {
                                "code": "451002001",
                                "value": "百城街道"
                            },
                            {
                                "code": "451002002",
                                "value": "龙景街道"
                            },
                            {
                                "code": "451002101",
                                "value": "阳圩镇"
                            },
                            {
                                "code": "451002102",
                                "value": "四塘镇"
                            },
                            {
                                "code": "451002103",
                                "value": "龙川镇"
                            },
                            {
                                "code": "451002104",
                                "value": "永乐镇"
                            },
                            {
                                "code": "451002202",
                                "value": "汪甸瑶族乡"
                            },
                            {
                                "code": "451002203",
                                "value": "大楞乡"
                            },
                            {
                                "code": "451002204",
                                "value": "泮水乡"
                            }
                        ]
                    },
                    {
                        "code": "451021",
                        "value": "田阳县",
                        "children": [
                            {
                                "code": "451021100",
                                "value": "田州镇"
                            },
                            {
                                "code": "451021101",
                                "value": "那坡镇"
                            },
                            {
                                "code": "451021102",
                                "value": "坡洪镇"
                            },
                            {
                                "code": "451021103",
                                "value": "那满镇"
                            },
                            {
                                "code": "451021104",
                                "value": "百育镇"
                            },
                            {
                                "code": "451021105",
                                "value": "玉凤镇"
                            },
                            {
                                "code": "451021106",
                                "value": "头塘镇"
                            },
                            {
                                "code": "451021107",
                                "value": "五村镇"
                            },
                            {
                                "code": "451021108",
                                "value": "洞靖镇"
                            },
                            {
                                "code": "451021204",
                                "value": "巴别乡"
                            }
                        ]
                    },
                    {
                        "code": "451022",
                        "value": "田东县",
                        "children": [
                            {
                                "code": "451022100",
                                "value": "平马镇"
                            },
                            {
                                "code": "451022101",
                                "value": "祥周镇"
                            },
                            {
                                "code": "451022103",
                                "value": "林逢镇"
                            },
                            {
                                "code": "451022105",
                                "value": "思林镇"
                            },
                            {
                                "code": "451022106",
                                "value": "印茶镇"
                            },
                            {
                                "code": "451022107",
                                "value": "江城镇"
                            },
                            {
                                "code": "451022108",
                                "value": "朔良镇"
                            },
                            {
                                "code": "451022109",
                                "value": "义圩镇"
                            },
                            {
                                "code": "451022110",
                                "value": "那拔镇"
                            },
                            {
                                "code": "451022201",
                                "value": "作登瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "451023",
                        "value": "平果县",
                        "children": [
                            {
                                "code": "451023100",
                                "value": "马头镇"
                            },
                            {
                                "code": "451023101",
                                "value": "新安镇"
                            },
                            {
                                "code": "451023102",
                                "value": "果化镇"
                            },
                            {
                                "code": "451023103",
                                "value": "太平镇"
                            },
                            {
                                "code": "451023104",
                                "value": "坡造镇"
                            },
                            {
                                "code": "451023105",
                                "value": "四塘镇"
                            },
                            {
                                "code": "451023106",
                                "value": "旧城镇"
                            },
                            {
                                "code": "451023107",
                                "value": "榜圩镇"
                            },
                            {
                                "code": "451023108",
                                "value": "凤梧镇"
                            },
                            {
                                "code": "451023200",
                                "value": "海城乡"
                            },
                            {
                                "code": "451023202",
                                "value": "黎明乡"
                            },
                            {
                                "code": "451023203",
                                "value": "同老乡"
                            },
                            {
                                "code": "451023450",
                                "value": "平果铝"
                            }
                        ]
                    },
                    {
                        "code": "451024",
                        "value": "德保县",
                        "children": [
                            {
                                "code": "451024100",
                                "value": "城关镇"
                            },
                            {
                                "code": "451024101",
                                "value": "足荣镇"
                            },
                            {
                                "code": "451024102",
                                "value": "隆桑镇"
                            },
                            {
                                "code": "451024103",
                                "value": "敬德镇"
                            },
                            {
                                "code": "451024104",
                                "value": "马隘镇"
                            },
                            {
                                "code": "451024105",
                                "value": "东凌镇"
                            },
                            {
                                "code": "451024106",
                                "value": "那甲镇"
                            },
                            {
                                "code": "451024200",
                                "value": "都安乡"
                            },
                            {
                                "code": "451024203",
                                "value": "荣华乡"
                            },
                            {
                                "code": "451024204",
                                "value": "燕峒乡"
                            },
                            {
                                "code": "451024205",
                                "value": "龙光乡"
                            },
                            {
                                "code": "451024206",
                                "value": "巴头乡"
                            },
                            {
                                "code": "451024450",
                                "value": "德保铝业"
                            }
                        ]
                    },
                    {
                        "code": "451026",
                        "value": "那坡县",
                        "children": [
                            {
                                "code": "451026100",
                                "value": "城厢镇"
                            },
                            {
                                "code": "451026101",
                                "value": "平孟镇"
                            },
                            {
                                "code": "451026102",
                                "value": "龙合镇"
                            },
                            {
                                "code": "451026200",
                                "value": "坡荷乡"
                            },
                            {
                                "code": "451026203",
                                "value": "德隆乡"
                            },
                            {
                                "code": "451026204",
                                "value": "百合乡"
                            },
                            {
                                "code": "451026205",
                                "value": "百南乡"
                            },
                            {
                                "code": "451026207",
                                "value": "百省乡"
                            },
                            {
                                "code": "451026208",
                                "value": "百都乡"
                            }
                        ]
                    },
                    {
                        "code": "451027",
                        "value": "凌云县",
                        "children": [
                            {
                                "code": "451027100",
                                "value": "泗城镇"
                            },
                            {
                                "code": "451027101",
                                "value": "逻楼镇"
                            },
                            {
                                "code": "451027102",
                                "value": "加尤镇"
                            },
                            {
                                "code": "451027103",
                                "value": "下甲镇"
                            },
                            {
                                "code": "451027201",
                                "value": "伶站瑶族乡"
                            },
                            {
                                "code": "451027202",
                                "value": "朝里瑶族乡"
                            },
                            {
                                "code": "451027203",
                                "value": "沙里瑶族乡"
                            },
                            {
                                "code": "451027205",
                                "value": "玉洪瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "451028",
                        "value": "乐业县",
                        "children": [
                            {
                                "code": "451028100",
                                "value": "同乐镇"
                            },
                            {
                                "code": "451028101",
                                "value": "甘田镇"
                            },
                            {
                                "code": "451028102",
                                "value": "新化镇"
                            },
                            {
                                "code": "451028103",
                                "value": "花坪镇"
                            },
                            {
                                "code": "451028201",
                                "value": "逻沙乡"
                            },
                            {
                                "code": "451028203",
                                "value": "逻西乡"
                            },
                            {
                                "code": "451028204",
                                "value": "幼平乡"
                            },
                            {
                                "code": "451028205",
                                "value": "雅长乡"
                            }
                        ]
                    },
                    {
                        "code": "451029",
                        "value": "田林县",
                        "children": [
                            {
                                "code": "451029100",
                                "value": "乐里镇"
                            },
                            {
                                "code": "451029101",
                                "value": "旧州镇"
                            },
                            {
                                "code": "451029102",
                                "value": "定安镇"
                            },
                            {
                                "code": "451029103",
                                "value": "六隆镇"
                            },
                            {
                                "code": "451029104",
                                "value": "浪平镇"
                            },
                            {
                                "code": "451029200",
                                "value": "潞城瑶族乡"
                            },
                            {
                                "code": "451029201",
                                "value": "利周瑶族乡"
                            },
                            {
                                "code": "451029202",
                                "value": "平塘乡"
                            },
                            {
                                "code": "451029204",
                                "value": "八桂瑶族乡"
                            },
                            {
                                "code": "451029205",
                                "value": "八渡瑶族乡"
                            },
                            {
                                "code": "451029206",
                                "value": "那比乡"
                            },
                            {
                                "code": "451029207",
                                "value": "高龙乡"
                            },
                            {
                                "code": "451029208",
                                "value": "百乐乡"
                            },
                            {
                                "code": "451029209",
                                "value": "者苗乡"
                            }
                        ]
                    },
                    {
                        "code": "451030",
                        "value": "西林县",
                        "children": [
                            {
                                "code": "451030100",
                                "value": "八达镇"
                            },
                            {
                                "code": "451030101",
                                "value": "古障镇"
                            },
                            {
                                "code": "451030102",
                                "value": "那劳镇"
                            },
                            {
                                "code": "451030103",
                                "value": "马蚌镇"
                            },
                            {
                                "code": "451030203",
                                "value": "普合苗族乡"
                            },
                            {
                                "code": "451030204",
                                "value": "西平乡"
                            },
                            {
                                "code": "451030206",
                                "value": "那佐苗族乡"
                            },
                            {
                                "code": "451030208",
                                "value": "足别瑶族苗族乡"
                            }
                        ]
                    },
                    {
                        "code": "451031",
                        "value": "隆林各族自治县",
                        "children": [
                            {
                                "code": "451031100",
                                "value": "新州镇"
                            },
                            {
                                "code": "451031101",
                                "value": "桠杈镇"
                            },
                            {
                                "code": "451031102",
                                "value": "天生桥镇"
                            },
                            {
                                "code": "451031103",
                                "value": "平班镇"
                            },
                            {
                                "code": "451031104",
                                "value": "德峨镇"
                            },
                            {
                                "code": "451031105",
                                "value": "隆或镇"
                            },
                            {
                                "code": "451031200",
                                "value": "沙梨乡"
                            },
                            {
                                "code": "451031203",
                                "value": "者保乡"
                            },
                            {
                                "code": "451031204",
                                "value": "者浪乡"
                            },
                            {
                                "code": "451031205",
                                "value": "革步乡"
                            },
                            {
                                "code": "451031206",
                                "value": "金钟山乡"
                            },
                            {
                                "code": "451031208",
                                "value": "猪场乡"
                            },
                            {
                                "code": "451031210",
                                "value": "蛇场乡"
                            },
                            {
                                "code": "451031211",
                                "value": "克长乡"
                            },
                            {
                                "code": "451031213",
                                "value": "岩茶乡"
                            },
                            {
                                "code": "451031215",
                                "value": "介廷乡"
                            }
                        ]
                    },
                    {
                        "code": "451081",
                        "value": "靖西市",
                        "children": [
                            {
                                "code": "451081100",
                                "value": "新靖镇"
                            },
                            {
                                "code": "451081101",
                                "value": "化峒镇"
                            },
                            {
                                "code": "451081102",
                                "value": "湖润镇"
                            },
                            {
                                "code": "451081103",
                                "value": "安德镇"
                            },
                            {
                                "code": "451081104",
                                "value": "龙临镇"
                            },
                            {
                                "code": "451081105",
                                "value": "渠洋镇"
                            },
                            {
                                "code": "451081106",
                                "value": "岳圩镇"
                            },
                            {
                                "code": "451081107",
                                "value": "龙邦镇"
                            },
                            {
                                "code": "451081108",
                                "value": "禄峒镇"
                            },
                            {
                                "code": "451081109",
                                "value": "武平镇"
                            },
                            {
                                "code": "451081110",
                                "value": "地州镇"
                            },
                            {
                                "code": "451081200",
                                "value": "同德乡"
                            },
                            {
                                "code": "451081201",
                                "value": "壬庄乡"
                            },
                            {
                                "code": "451081202",
                                "value": "安宁乡"
                            },
                            {
                                "code": "451081206",
                                "value": "南坡乡"
                            },
                            {
                                "code": "451081207",
                                "value": "吞盘乡"
                            },
                            {
                                "code": "451081209",
                                "value": "果乐乡"
                            },
                            {
                                "code": "451081211",
                                "value": "新甲乡"
                            },
                            {
                                "code": "451081215",
                                "value": "魁圩乡"
                            }
                        ]
                    }
                ]
            },
            {
                "code": "4511",
                "value": "贺州市",
                "children": [
                    {
                        "code": "451102",
                        "value": "八步区",
                        "children": [
                            {
                                "code": "451102001",
                                "value": "八步街道"
                            },
                            {
                                "code": "451102002",
                                "value": "城东街道"
                            },
                            {
                                "code": "451102003",
                                "value": "江南街道"
                            },
                            {
                                "code": "451102101",
                                "value": "贺街镇"
                            },
                            {
                                "code": "451102102",
                                "value": "步头镇"
                            },
                            {
                                "code": "451102103",
                                "value": "莲塘镇"
                            },
                            {
                                "code": "451102104",
                                "value": "大宁镇"
                            },
                            {
                                "code": "451102105",
                                "value": "南乡镇"
                            },
                            {
                                "code": "451102106",
                                "value": "桂岭镇"
                            },
                            {
                                "code": "451102107",
                                "value": "开山镇"
                            },
                            {
                                "code": "451102109",
                                "value": "里松镇"
                            },
                            {
                                "code": "451102114",
                                "value": "信都镇"
                            },
                            {
                                "code": "451102115",
                                "value": "灵峰镇"
                            },
                            {
                                "code": "451102116",
                                "value": "仁义镇"
                            },
                            {
                                "code": "451102117",
                                "value": "铺门镇"
                            },
                            {
                                "code": "451102200",
                                "value": "黄洞瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "451103",
                        "value": "平桂区",
                        "children": [
                            {
                                "code": "451103001",
                                "value": "西湾街道"
                            },
                            {
                                "code": "451103101",
                                "value": "黄田镇"
                            },
                            {
                                "code": "451103102",
                                "value": "鹅塘镇"
                            },
                            {
                                "code": "451103103",
                                "value": "沙田镇"
                            },
                            {
                                "code": "451103104",
                                "value": "公会镇"
                            },
                            {
                                "code": "451103105",
                                "value": "水口镇"
                            },
                            {
                                "code": "451103106",
                                "value": "望高镇"
                            },
                            {
                                "code": "451103107",
                                "value": "羊头镇"
                            },
                            {
                                "code": "451103201",
                                "value": "大平瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "451121",
                        "value": "昭平县",
                        "children": [
                            {
                                "code": "451121100",
                                "value": "昭平镇"
                            },
                            {
                                "code": "451121101",
                                "value": "文竹镇"
                            },
                            {
                                "code": "451121102",
                                "value": "黄姚镇"
                            },
                            {
                                "code": "451121103",
                                "value": "富罗镇"
                            },
                            {
                                "code": "451121104",
                                "value": "北陀镇"
                            },
                            {
                                "code": "451121105",
                                "value": "马江镇"
                            },
                            {
                                "code": "451121107",
                                "value": "五将镇"
                            },
                            {
                                "code": "451121108",
                                "value": "走马镇"
                            },
                            {
                                "code": "451121109",
                                "value": "樟木林镇"
                            },
                            {
                                "code": "451121201",
                                "value": "仙回瑶族乡"
                            },
                            {
                                "code": "451121206",
                                "value": "凤凰乡"
                            },
                            {
                                "code": "451121208",
                                "value": "木格乡"
                            }
                        ]
                    },
                    {
                        "code": "451122",
                        "value": "钟山县",
                        "children": [
                            {
                                "code": "451122100",
                                "value": "钟山镇"
                            },
                            {
                                "code": "451122104",
                                "value": "回龙镇"
                            },
                            {
                                "code": "451122105",
                                "value": "石龙镇"
                            },
                            {
                                "code": "451122106",
                                "value": "凤翔镇"
                            },
                            {
                                "code": "451122107",
                                "value": "珊瑚镇"
                            },
                            {
                                "code": "451122108",
                                "value": "同古镇"
                            },
                            {
                                "code": "451122109",
                                "value": "公安镇"
                            },
                            {
                                "code": "451122111",
                                "value": "清塘镇"
                            },
                            {
                                "code": "451122112",
                                "value": "燕塘镇"
                            },
                            {
                                "code": "451122113",
                                "value": "红花镇"
                            },
                            {
                                "code": "451122200",
                                "value": "花山瑶族乡"
                            },
                            {
                                "code": "451122201",
                                "value": "两安瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "451123",
                        "value": "富川瑶族自治县",
                        "children": [
                            {
                                "code": "451123100",
                                "value": "富阳镇"
                            },
                            {
                                "code": "451123101",
                                "value": "白沙镇"
                            },
                            {
                                "code": "451123102",
                                "value": "莲山镇"
                            },
                            {
                                "code": "451123103",
                                "value": "古城镇"
                            },
                            {
                                "code": "451123104",
                                "value": "福利镇"
                            },
                            {
                                "code": "451123105",
                                "value": "麦岭镇"
                            },
                            {
                                "code": "451123106",
                                "value": "葛坡镇"
                            },
                            {
                                "code": "451123107",
                                "value": "城北镇"
                            },
                            {
                                "code": "451123108",
                                "value": "朝东镇"
                            },
                            {
                                "code": "451123200",
                                "value": "新华乡"
                            },
                            {
                                "code": "451123201",
                                "value": "石家乡"
                            },
                            {
                                "code": "451123203",
                                "value": "柳家乡"
                            }
                        ]
                    }
                ]
            },
            {
                "code": "4512",
                "value": "河池市",
                "children": [
                    {
                        "code": "451202",
                        "value": "金城江区",
                        "children": [
                            {
                                "code": "451202001",
                                "value": "金城江街道"
                            },
                            {
                                "code": "451202101",
                                "value": "东江镇"
                            },
                            {
                                "code": "451202102",
                                "value": "六圩镇"
                            },
                            {
                                "code": "451202103",
                                "value": "六甲镇"
                            },
                            {
                                "code": "451202104",
                                "value": "河池镇"
                            },
                            {
                                "code": "451202105",
                                "value": "拔贡镇"
                            },
                            {
                                "code": "451202106",
                                "value": "九圩镇"
                            },
                            {
                                "code": "451202107",
                                "value": "五圩镇"
                            },
                            {
                                "code": "451202200",
                                "value": "白土乡"
                            },
                            {
                                "code": "451202203",
                                "value": "侧岭乡"
                            },
                            {
                                "code": "451202204",
                                "value": "保平乡"
                            },
                            {
                                "code": "451202205",
                                "value": "长老乡"
                            }
                        ]
                    },
                    {
                        "code": "451203",
                        "value": "宜州区",
                        "children": [
                            {
                                "code": "451203100",
                                "value": "庆远镇"
                            },
                            {
                                "code": "451203101",
                                "value": "三岔镇"
                            },
                            {
                                "code": "451203102",
                                "value": "洛西镇"
                            },
                            {
                                "code": "451203103",
                                "value": "怀远镇"
                            },
                            {
                                "code": "451203104",
                                "value": "德胜镇"
                            },
                            {
                                "code": "451203105",
                                "value": "石别镇"
                            },
                            {
                                "code": "451203106",
                                "value": "北山镇"
                            },
                            {
                                "code": "451203107",
                                "value": "刘三姐镇"
                            },
                            {
                                "code": "451203108",
                                "value": "洛东镇"
                            },
                            {
                                "code": "451203200",
                                "value": "祥贝乡"
                            },
                            {
                                "code": "451203203",
                                "value": "屏南乡"
                            },
                            {
                                "code": "451203207",
                                "value": "福龙瑶族乡"
                            },
                            {
                                "code": "451203208",
                                "value": "北牙瑶族乡"
                            },
                            {
                                "code": "451203210",
                                "value": "同德乡"
                            },
                            {
                                "code": "451203211",
                                "value": "安马乡"
                            },
                            {
                                "code": "451203213",
                                "value": "龙头乡"
                            }
                        ]
                    },
                    {
                        "code": "451221",
                        "value": "南丹县",
                        "children": [
                            {
                                "code": "451221100",
                                "value": "城关镇"
                            },
                            {
                                "code": "451221101",
                                "value": "大厂镇"
                            },
                            {
                                "code": "451221102",
                                "value": "车河镇"
                            },
                            {
                                "code": "451221103",
                                "value": "芒场镇"
                            },
                            {
                                "code": "451221104",
                                "value": "六寨镇"
                            },
                            {
                                "code": "451221105",
                                "value": "月里镇"
                            },
                            {
                                "code": "451221106",
                                "value": "吾隘镇"
                            },
                            {
                                "code": "451221107",
                                "value": "罗富镇"
                            },
                            {
                                "code": "451221202",
                                "value": "中堡苗族乡"
                            },
                            {
                                "code": "451221203",
                                "value": "八圩瑶族乡"
                            },
                            {
                                "code": "451221204",
                                "value": "里湖瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "451222",
                        "value": "天峨县",
                        "children": [
                            {
                                "code": "451222100",
                                "value": "六排镇"
                            },
                            {
                                "code": "451222101",
                                "value": "向阳镇"
                            },
                            {
                                "code": "451222200",
                                "value": "岜暮乡"
                            },
                            {
                                "code": "451222201",
                                "value": "八腊瑶族乡"
                            },
                            {
                                "code": "451222203",
                                "value": "纳直乡"
                            },
                            {
                                "code": "451222204",
                                "value": "更新乡"
                            },
                            {
                                "code": "451222206",
                                "value": "下老乡"
                            },
                            {
                                "code": "451222207",
                                "value": "坡结乡"
                            },
                            {
                                "code": "451222208",
                                "value": "三堡乡"
                            }
                        ]
                    },
                    {
                        "code": "451223",
                        "value": "凤山县",
                        "children": [
                            {
                                "code": "451223100",
                                "value": "凤城镇"
                            },
                            {
                                "code": "451223101",
                                "value": "长洲镇"
                            },
                            {
                                "code": "451223102",
                                "value": "三门海镇"
                            },
                            {
                                "code": "451223201",
                                "value": "砦牙乡"
                            },
                            {
                                "code": "451223203",
                                "value": "乔音乡"
                            },
                            {
                                "code": "451223205",
                                "value": "金牙瑶族乡"
                            },
                            {
                                "code": "451223207",
                                "value": "中亭乡"
                            },
                            {
                                "code": "451223208",
                                "value": "平乐瑶族乡"
                            },
                            {
                                "code": "451223209",
                                "value": "江洲瑶族乡"
                            }
                        ]
                    },
                    {
                        "code": "451224",
                        "value": "东兰县",
                        "children": [
                            {
                                "code": "451224100",
                                "value": "东兰镇"
                            },
                            {
                                "code": "451224101",
                                "value": "隘洞镇"
                            },
                            {
                                "code": "451224102",
                                "value": "长乐镇"
                            },
                            {
                                "code": "451224103",
                                "value": "三石镇"
                            },
                            {
                                "code": "451224104",
                                "value": "武篆镇"
                            },
                            {
                                "code": "451224105",
                                "value": "长江镇"
                            },
                            {
                                "code": "451224200",
                                "value": "泗孟乡"
                            },
                            {
                                "code": "451224201",
                                "value": "兰木乡"
                            },
                            {
                                "code": "451224203",
                                "value": "巴畴乡"
                            },
                            {
                                "code": "451224204",
                                "value": "金谷乡"
                            },
                            {
                                "code": "451224205",
                                "value": "三弄瑶族乡"
                            },
                            {
                                "code": "451224206",
                                "value": "大同乡"
                            },
                            {
                                "code": "451224207",
                                "value": "花香乡"
                            },
                            {
                                "code": "451224208",
                                "value": "切学乡"
                            }
                        ]
                    },
                    {
                        "code": "451225",
                        "value": "罗城仫佬族自治县",
                        "children": [
                            {
                                "code": "451225100",
                                "value": "东门镇"
                            },
                            {
                                "code": "451225101",
                                "value": "龙岸镇"
                            },
                            {
                                "code": "451225102",
                                "value": "黄金镇"
                            },
                            {
                                "code": "451225103",
                                "value": "小长安镇"
                            },
                            {
                                "code": "451225105",
                                "value": "四把镇"
                            },
                            {
                                "code": "451225106",
                                "value": "天河镇"
                            },
                            {
                                "code": "451225107",
                                "value": "怀群镇"
                            },
                            {
                                "code": "451225200",
                                "value": "宝坛乡"
                            },
                            {
                                "code": "451225202",
                                "value": "乔善乡"
                            },
                            {
                                "code": "451225203",
                                "value": "纳翁乡"
                            },
                            {
                                "code": "451225204",
                                "value": "兼爱乡"
                            }
                        ]
                    },
                    {
                        "code": "451226",
                        "value": "环江毛南族自治县",
                        "children": [
                            {
                                "code": "451226100",
                                "value": "思恩镇"
                            },
                            {
                                "code": "451226101",
                                "value": "水源镇"
                            },
                            {
                                "code": "451226102",
                                "value": "洛阳镇"
                            },
                            {
                                "code": "451226103",
                                "value": "川山镇"
                            },
                            {
                                "code": "451226104",
                                "value": "明伦镇"
                            },
                            {
                                "code": "451226105",
                                "value": "东兴镇"
                            },
                            {
                                "code": "451226200",
                                "value": "大才乡"
                            },
                            {
                                "code": "451226202",
                                "value": "下南乡"
                            },
                            {
                                "code": "451226204",
                                "value": "大安乡"
                            },
                            {
                                "code": "451226205",
                                "value": "长美乡"
                            },
                            {
                                "code": "451226206",
                                "value": "龙岩乡"
                            },
                            {
                                "code": "451226207",
                                "value": "驯乐苗族乡"
                            }
                        ]
                    },
                    {
                        "code": "451227",
                        "value": "巴马瑶族自治县",
                        "children": [
                            {
                                "code": "451227100",
                                "value": "巴马镇"
                            },
                            {
                                "code": "451227101",
                                "value": "甲篆镇"
                            },
                            {
                                "code": "451227102",
                                "value": "燕洞镇"
                            },
                            {
                                "code": "451227202",
                                "value": "那社乡"
                            },
                            {
                                "code": "451227203",
                                "value": "所略乡"
                            },
                            {
                                "code": "451227205",
                                "value": "西山乡"
                            },
                            {
                                "code": "451227207",
                                "value": "东山乡"
                            },
                            {
                                "code": "451227208",
                                "value": "凤凰乡"
                            },
                            {
                                "code": "451227209",
                                "value": "百林乡"
                            },
                            {
                                "code": "451227210",
                                "value": "那桃乡"
                            }
                        ]
                    },
                    {
                        "code": "451228",
                        "value": "都安瑶族自治县",
                        "children": [
                            {
                                "code": "451228100",
                                "value": "安阳镇"
                            },
                            {
                                "code": "451228101",
                                "value": "高岭镇"
                            },
                            {
                                "code": "451228102",
                                "value": "地苏镇"
                            },
                            {
                                "code": "451228103",
                                "value": "下坳镇"
                            },
                            {
                                "code": "451228104",
                                "value": "拉烈镇"
                            },
                            {
                                "code": "451228105",
                                "value": "百旺镇"
                            },
                            {
                                "code": "451228106",
                                "value": "澄江镇"
                            },
                            {
                                "code": "451228107",
                                "value": "大兴镇"
                            },
                            {
                                "code": "451228108",
                                "value": "拉仁镇"
                            },
                            {
                                "code": "451228109",
                                "value": "永安镇"
                            },
                            {
                                "code": "451228204",
                                "value": "东庙乡"
                            },
                            {
                                "code": "451228208",
                                "value": "隆福乡"
                            },
                            {
                                "code": "451228209",
                                "value": "保安乡"
                            },
                            {
                                "code": "451228210",
                                "value": "板岭乡"
                            },
                            {
                                "code": "451228212",
                                "value": "三只羊乡"
                            },
                            {
                                "code": "451228213",
                                "value": "龙湾乡"
                            },
                            {
                                "code": "451228214",
                                "value": "菁盛乡"
                            },
                            {
                                "code": "451228217",
                                "value": "加贵乡"
                            },
                            {
                                "code": "451228219",
                                "value": "九渡乡"
                            }
                        ]
                    },
                    {
                        "code": "451229",
                        "value": "大化瑶族自治县",
                        "children": [
                            {
                                "code": "451229100",
                                "value": "大化镇"
                            },
                            {
                                "code": "451229101",
                                "value": "都阳镇"
                            },
                            {
                                "code": "451229102",
                                "value": "岩滩镇"
                            },
                            {
                                "code": "451229103",
                                "value": "北景镇"
                            },
                            {
                                "code": "451229200",
                                "value": "共和乡"
                            },
                            {
                                "code": "451229201",
                                "value": "贡川乡"
                            },
                            {
                                "code": "451229202",
                                "value": "百马乡"
                            },
                            {
                                "code": "451229203",
                                "value": "古河乡"
                            },
                            {
                                "code": "451229204",
                                "value": "古文乡"
                            },
                            {
                                "code": "451229205",
                                "value": "江南乡"
                            },
                            {
                                "code": "451229206",
                                "value": "羌圩乡"
                            },
                            {
                                "code": "451229207",
                                "value": "乙圩乡"
                            },
                            {
                                "code": "451229210",
                                "value": "板升乡"
                            },
                            {
                                "code": "451229211",
                                "value": "七百弄乡"
                            },
                            {
                                "code": "451229213",
                                "value": "雅龙乡"
                            },
                            {
                                "code": "451229214",
                                "value": "六也乡"
                            }
                        ]
                    }
                ]
            },
            {
                "code": "4513",
                "value": "来宾市",
                "children": [
                    {
                        "code": "451302",
                        "value": "兴宾区",
                        "children": [
                            {
                                "code": "451302001",
                                "value": "城东街道"
                            },
                            {
                                "code": "451302002",
                                "value": "城北街道"
                            },
                            {
                                "code": "451302003",
                                "value": "河西街道"
                            },
                            {
                                "code": "451302005",
                                "value": "来华街道"
                            },
                            {
                                "code": "451302101",
                                "value": "凤凰镇"
                            },
                            {
                                "code": "451302102",
                                "value": "良江镇"
                            },
                            {
                                "code": "451302103",
                                "value": "小平阳镇"
                            },
                            {
                                "code": "451302104",
                                "value": "迁江镇"
                            },
                            {
                                "code": "451302105",
                                "value": "石陵镇"
                            },
                            {
                                "code": "451302106",
                                "value": "平阳镇"
                            },
                            {
                                "code": "451302107",
                                "value": "蒙村镇"
                            },
                            {
                                "code": "451302108",
                                "value": "大湾镇"
                            },
                            {
                                "code": "451302109",
                                "value": "桥巩镇"
                            },
                            {
                                "code": "451302110",
                                "value": "寺山镇"
                            },
                            {
                                "code": "451302111",
                                "value": "城厢镇"
                            },
                            {
                                "code": "451302112",
                                "value": "三五镇"
                            },
                            {
                                "code": "451302113",
                                "value": "陶邓镇"
                            },
                            {
                                "code": "451302114",
                                "value": "石牙镇"
                            },
                            {
                                "code": "451302202",
                                "value": "五山乡"
                            },
                            {
                                "code": "451302205",
                                "value": "良塘乡"
                            },
                            {
                                "code": "451302206",
                                "value": "七洞乡"
                            },
                            {
                                "code": "451302213",
                                "value": "南泗乡"
                            },
                            {
                                "code": "451302214",
                                "value": "高安乡"
                            },
                            {
                                "code": "451302216",
                                "value": "正龙乡"
                            },
                            {
                                "code": "451302402",
                                "value": "来华投资区"
                            }
                        ]
                    },
                    {
                        "code": "451321",
                        "value": "忻城县",
                        "children": [
                            {
                                "code": "451321100",
                                "value": "城关镇"
                            },
                            {
                                "code": "451321101",
                                "value": "大塘镇"
                            },
                            {
                                "code": "451321102",
                                "value": "思练镇"
                            },
                            {
                                "code": "451321103",
                                "value": "红渡镇"
                            },
                            {
                                "code": "451321104",
                                "value": "古蓬镇"
                            },
                            {
                                "code": "451321105",
                                "value": "果遂镇"
                            },
                            {
                                "code": "451321201",
                                "value": "马泗乡"
                            },
                            {
                                "code": "451321202",
                                "value": "欧洞乡"
                            },
                            {
                                "code": "451321203",
                                "value": "安东乡"
                            },
                            {
                                "code": "451321205",
                                "value": "新圩乡"
                            },
                            {
                                "code": "451321206",
                                "value": "遂意乡"
                            },
                            {
                                "code": "451321207",
                                "value": "北更乡"
                            }
                        ]
                    },
                    {
                        "code": "451322",
                        "value": "象州县",
                        "children": [
                            {
                                "code": "451322100",
                                "value": "象州镇"
                            },
                            {
                                "code": "451322101",
                                "value": "石龙镇"
                            },
                            {
                                "code": "451322102",
                                "value": "运江镇"
                            },
                            {
                                "code": "451322103",
                                "value": "寺村镇"
                            },
                            {
                                "code": "451322104",
                                "value": "中平镇"
                            },
                            {
                                "code": "451322105",
                                "value": "罗秀镇"
                            },
                            {
                                "code": "451322106",
                                "value": "大乐镇"
                            },
                            {
                                "code": "451322107",
                                "value": "马坪镇"
                            },
                            {
                                "code": "451322201",
                                "value": "妙皇乡"
                            },
                            {
                                "code": "451322202",
                                "value": "百丈乡"
                            },
                            {
                                "code": "451322203",
                                "value": "水晶乡"
                            }
                        ]
                    },
                    {
                        "code": "451323",
                        "value": "武宣县",
                        "children": [
                            {
                                "code": "451323100",
                                "value": "武宣镇"
                            },
                            {
                                "code": "451323101",
                                "value": "桐岭镇"
                            },
                            {
                                "code": "451323102",
                                "value": "通挽镇"
                            },
                            {
                                "code": "451323103",
                                "value": "东乡镇"
                            },
                            {
                                "code": "451323104",
                                "value": "三里镇"
                            },
                            {
                                "code": "451323105",
                                "value": "二塘镇"
                            },
                            {
                                "code": "451323106",
                                "value": "黄茆镇"
                            },
                            {
                                "code": "451323107",
                                "value": "禄新镇"
                            },
                            {
                                "code": "451323108",
                                "value": "思灵镇"
                            },
                            {
                                "code": "451323204",
                                "value": "金鸡乡"
                            },
                            {
                                "code": "451323401",
                                "value": "黔江农场"
                            }
                        ]
                    },
                    {
                        "code": "451324",
                        "value": "金秀瑶族自治县",
                        "children": [
                            {
                                "code": "451324100",
                                "value": "金秀镇"
                            },
                            {
                                "code": "451324101",
                                "value": "桐木镇"
                            },
                            {
                                "code": "451324102",
                                "value": "头排镇"
                            },
                            {
                                "code": "451324200",
                                "value": "三角乡"
                            },
                            {
                                "code": "451324201",
                                "value": "忠良乡"
                            },
                            {
                                "code": "451324202",
                                "value": "罗香乡"
                            },
                            {
                                "code": "451324203",
                                "value": "长垌乡"
                            },
                            {
                                "code": "451324204",
                                "value": "大樟乡"
                            },
                            {
                                "code": "451324205",
                                "value": "六巷乡"
                            },
                            {
                                "code": "451324207",
                                "value": "三江乡"
                            }
                        ]
                    },
                    {
                        "code": "451381",
                        "value": "合山市",
                        "children": [
                            {
                                "code": "451381100",
                                "value": "岭南镇"
                            },
                            {
                                "code": "451381101",
                                "value": "北泗镇"
                            },
                            {
                                "code": "451381102",
                                "value": "河里镇"
                            }
                        ]
                    }
                ]
            },
            {
                "code": "4514",
                "value": "崇左市",
                "children": [
                    {
                        "code": "451402",
                        "value": "江州区",
                        "children": [
                            {
                                "code": "451402001",
                                "value": "太平街道"
                            },
                            {
                                "code": "451402002",
                                "value": "江南街道"
                            },
                            {
                                "code": "451402003",
                                "value": "石景林街道"
                            },
                            {
                                "code": "451402101",
                                "value": "新和镇"
                            },
                            {
                                "code": "451402102",
                                "value": "濑湍镇"
                            },
                            {
                                "code": "451402103",
                                "value": "江州镇"
                            },
                            {
                                "code": "451402104",
                                "value": "左州镇"
                            },
                            {
                                "code": "451402105",
                                "value": "那隆镇"
                            },
                            {
                                "code": "451402106",
                                "value": "驮卢镇"
                            },
                            {
                                "code": "451402201",
                                "value": "罗白乡"
                            },
                            {
                                "code": "451402202",
                                "value": "板利乡"
                            },
                            {
                                "code": "451402400",
                                "value": "新和华侨农场"
                            },
                            {
                                "code": "451402401",
                                "value": "左江华侨农场"
                            }
                        ]
                    },
                    {
                        "code": "451421",
                        "value": "扶绥县",
                        "children": [
                            {
                                "code": "451421100",
                                "value": "新宁镇"
                            },
                            {
                                "code": "451421101",
                                "value": "渠黎镇"
                            },
                            {
                                "code": "451421102",
                                "value": "渠旧镇"
                            },
                            {
                                "code": "451421103",
                                "value": "柳桥镇"
                            },
                            {
                                "code": "451421104",
                                "value": "东门镇"
                            },
                            {
                                "code": "451421105",
                                "value": "山圩镇"
                            },
                            {
                                "code": "451421106",
                                "value": "中东镇"
                            },
                            {
                                "code": "451421107",
                                "value": "东罗镇"
                            },
                            {
                                "code": "451421201",
                                "value": "龙头乡"
                            },
                            {
                                "code": "451421202",
                                "value": "岜盆乡"
                            },
                            {
                                "code": "451421203",
                                "value": "昌平乡"
                            },
                            {
                                "code": "451421400",
                                "value": "广西农垦国有山圩农场"
                            }
                        ]
                    },
                    {
                        "code": "451422",
                        "value": "宁明县",
                        "children": [
                            {
                                "code": "451422100",
                                "value": "城中镇"
                            },
                            {
                                "code": "451422101",
                                "value": "爱店镇"
                            },
                            {
                                "code": "451422102",
                                "value": "明江镇"
                            },
                            {
                                "code": "451422103",
                                "value": "海渊镇"
                            },
                            {
                                "code": "451422104",
                                "value": "桐棉镇"
                            },
                            {
                                "code": "451422105",
                                "value": "那堪镇"
                            },
                            {
                                "code": "451422106",
                                "value": "亭亮镇"
                            },
                            {
                                "code": "451422202",
                                "value": "寨安乡"
                            },
                            {
                                "code": "451422203",
                                "value": "峙浪乡"
                            },
                            {
                                "code": "451422204",
                                "value": "东安乡"
                            },
                            {
                                "code": "451422205",
                                "value": "板棍乡"
                            },
                            {
                                "code": "451422206",
                                "value": "北江乡"
                            },
                            {
                                "code": "451422209",
                                "value": "那楠乡"
                            },
                            {
                                "code": "451422401",
                                "value": "国营宁明华侨农场"
                            },
                            {
                                "code": "451422402",
                                "value": "国营天西华侨农场"
                            }
                        ]
                    },
                    {
                        "code": "451423",
                        "value": "龙州县",
                        "children": [
                            {
                                "code": "451423100",
                                "value": "龙州镇"
                            },
                            {
                                "code": "451423101",
                                "value": "下冻镇"
                            },
                            {
                                "code": "451423102",
                                "value": "水口镇"
                            },
                            {
                                "code": "451423103",
                                "value": "金龙镇"
                            },
                            {
                                "code": "451423104",
                                "value": "响水镇"
                            },
                            {
                                "code": "451423201",
                                "value": "八角乡"
                            },
                            {
                                "code": "451423202",
                                "value": "上降乡"
                            },
                            {
                                "code": "451423203",
                                "value": "彬桥乡"
                            },
                            {
                                "code": "451423204",
                                "value": "上龙乡"
                            },
                            {
                                "code": "451423205",
                                "value": "武德乡"
                            },
                            {
                                "code": "451423206",
                                "value": "逐卜乡"
                            },
                            {
                                "code": "451423207",
                                "value": "上金乡"
                            }
                        ]
                    },
                    {
                        "code": "451424",
                        "value": "大新县",
                        "children": [
                            {
                                "code": "451424100",
                                "value": "桃城镇"
                            },
                            {
                                "code": "451424101",
                                "value": "全茗镇"
                            },
                            {
                                "code": "451424102",
                                "value": "雷平镇"
                            },
                            {
                                "code": "451424103",
                                "value": "硕龙镇"
                            },
                            {
                                "code": "451424104",
                                "value": "下雷镇"
                            },
                            {
                                "code": "451424200",
                                "value": "五山乡"
                            },
                            {
                                "code": "451424201",
                                "value": "龙门乡"
                            },
                            {
                                "code": "451424202",
                                "value": "昌明乡"
                            },
                            {
                                "code": "451424203",
                                "value": "福隆乡"
                            },
                            {
                                "code": "451424204",
                                "value": "那岭乡"
                            },
                            {
                                "code": "451424205",
                                "value": "恩城乡"
                            },
                            {
                                "code": "451424206",
                                "value": "榄圩乡"
                            },
                            {
                                "code": "451424207",
                                "value": "宝圩乡"
                            },
                            {
                                "code": "451424208",
                                "value": "堪圩乡"
                            },
                            {
                                "code": "451424400",
                                "value": "国营桃城华侨农场"
                            }
                        ]
                    },
                    {
                        "code": "451425",
                        "value": "天等县",
                        "children": [
                            {
                                "code": "451425100",
                                "value": "天等镇"
                            },
                            {
                                "code": "451425101",
                                "value": "龙茗镇"
                            },
                            {
                                "code": "451425102",
                                "value": "进结镇"
                            },
                            {
                                "code": "451425103",
                                "value": "向都镇"
                            },
                            {
                                "code": "451425104",
                                "value": "东平镇"
                            },
                            {
                                "code": "451425105",
                                "value": "福新镇"
                            },
                            {
                                "code": "451425200",
                                "value": "都康乡"
                            },
                            {
                                "code": "451425201",
                                "value": "宁干乡"
                            },
                            {
                                "code": "451425202",
                                "value": "驮堪乡"
                            },
                            {
                                "code": "451425205",
                                "value": "进远乡"
                            },
                            {
                                "code": "451425206",
                                "value": "上映乡"
                            },
                            {
                                "code": "451425207",
                                "value": "把荷乡"
                            },
                            {
                                "code": "451425208",
                                "value": "小山乡"
                            }
                        ]
                    },
                    {
                        "code": "451481",
                        "value": "凭祥市",
                        "children": [
                            {
                                "code": "451481100",
                                "value": "凭祥镇"
                            },
                            {
                                "code": "451481101",
                                "value": "友谊镇"
                            },
                            {
                                "code": "451481102",
                                "value": "上石镇"
                            },
                            {
                                "code": "451481103",
                                "value": "夏石镇"
                            },
                            {
                                "code": "451481400",
                                "value": "广西凭祥综合保税区"
                            }
                        ]
                    }
                ]
            }
        ]
    }
]
export default options
